select "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД", "Н_ВЕДОМОСТИ"."ДАТА"
from "Н_ТИПЫ_ВЕДОМОСТЕЙ"
         left join "Н_ВЕДОМОСТИ"
                   on "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" = 1 and "Н_ВЕДОМОСТИ"."ИД" < 1426978;

select "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."УЧГОД"
from "Н_ЛЮДИ"
         right join "Н_ВЕДОМОСТИ"
                    on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         right join "Н_СЕССИЯ"
                    on "Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
where "Н_ЛЮДИ"."ИМЯ" < 'Роман'
  and "Н_ВЕДОМОСТИ"."ДАТА" = '2022-06-08'
  and "Н_СЕССИЯ"."ДАТА" > '2012-01-25';
