Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x7a7 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xcdcad): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xcc08c): ../Core/Src/buzzer.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xfe60): C:/Users/nikit/STM32CubeIDE/workspace_1.19.0/EmbLab2/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x687b8): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0xc9e7f): unsigned char
 <1><38>: Abbrev Number: 5 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x9bd12): short int
 <1><3f>: Abbrev Number: 6 (DW_TAG_typedef)
    <40>   DW_AT_name        : (indirect string, offset: 0xaa9b2): __uint16_t
    <44>   DW_AT_decl_file   : 2
    <45>   DW_AT_decl_line   : 57
    <46>   DW_AT_decl_column : 25
    <47>   DW_AT_type        : <0x4b>
 <1><4b>: Abbrev Number: 5 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0xc875a): short unsigned int
 <1><52>: Abbrev Number: 5 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0x115e7): long int
 <1><59>: Abbrev Number: 6 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x854dd): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 5 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x4f87b): long unsigned int
 <1><6c>: Abbrev Number: 5 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x5f061): long long int
 <1><73>: Abbrev Number: 5 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x2b4f1): long long unsigned int
 <1><7a>: Abbrev Number: 22 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 5 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0x10bb4): unsigned int
 <1><88>: Abbrev Number: 6 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0xd6ea2): uint16_t
    <8d>   DW_AT_decl_file   : 3
    <8e>   DW_AT_decl_line   : 36
    <8f>   DW_AT_decl_column : 20
    <90>   DW_AT_type        : <0x3f>
 <1><94>: Abbrev Number: 6 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0xd6e82): uint32_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a6>   DW_AT_byte_size   : 24
    <a7>   DW_AT_decl_file   : 4
    <a8>   DW_AT_decl_line   : 350
    <aa>   DW_AT_decl_column : 9
    <aa>   DW_AT_sibling     : <0xfc>
 <2><ae>: Abbrev Number: 4 (DW_TAG_member)
    <af>   DW_AT_name        : CR
    <b2>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 352
    <b4>   DW_AT_decl_column : 17
    <b4>   DW_AT_type        : <0xa0>
    <b8>   DW_AT_data_member_location: 0
 <2><b9>: Abbrev Number: 3 (DW_TAG_member)
    <ba>   DW_AT_name        : (indirect string, offset: 0x4f074): NDTR
    <be>   DW_AT_decl_file   : 4
    <bf>   DW_AT_decl_line   : 353
    <c1>   DW_AT_decl_column : 17
    <c2>   DW_AT_type        : <0xa0>
    <c6>   DW_AT_data_member_location: 4
 <2><c7>: Abbrev Number: 4 (DW_TAG_member)
    <c8>   DW_AT_name        : PAR
    <cc>   DW_AT_decl_file   : 4
    <cc>   DW_AT_decl_line   : 354
    <ce>   DW_AT_decl_column : 17
    <ce>   DW_AT_type        : <0xa0>
    <d2>   DW_AT_data_member_location: 8
 <2><d3>: Abbrev Number: 3 (DW_TAG_member)
    <d4>   DW_AT_name        : (indirect string, offset: 0x5640e): M0AR
    <d8>   DW_AT_decl_file   : 4
    <d9>   DW_AT_decl_line   : 355
    <db>   DW_AT_decl_column : 17
    <dc>   DW_AT_type        : <0xa0>
    <e0>   DW_AT_data_member_location: 12
 <2><e1>: Abbrev Number: 3 (DW_TAG_member)
    <e2>   DW_AT_name        : (indirect string, offset: 0x73bdb): M1AR
    <e6>   DW_AT_decl_file   : 4
    <e7>   DW_AT_decl_line   : 356
    <e9>   DW_AT_decl_column : 17
    <ea>   DW_AT_type        : <0xa0>
    <ee>   DW_AT_data_member_location: 16
 <2><ef>: Abbrev Number: 4 (DW_TAG_member)
    <f0>   DW_AT_name        : FCR
    <f4>   DW_AT_decl_file   : 4
    <f4>   DW_AT_decl_line   : 357
    <f6>   DW_AT_decl_column : 17
    <f6>   DW_AT_type        : <0xa0>
    <fa>   DW_AT_data_member_location: 20
 <2><fb>: Abbrev Number: 0
 <1><fc>: Abbrev Number: 8 (DW_TAG_typedef)
    <fd>   DW_AT_name        : (indirect string, offset: 0x194e5): DMA_Stream_TypeDef
    <101>   DW_AT_decl_file   : 4
    <102>   DW_AT_decl_line   : 358
    <104>   DW_AT_decl_column : 3
    <104>   DW_AT_type        : <0xa5>
 <1><108>: Abbrev Number: 14 (DW_TAG_structure_type)
    <109>   DW_AT_byte_size   : 84
    <10a>   DW_AT_decl_file   : 4
    <10b>   DW_AT_decl_line   : 798
    <10d>   DW_AT_decl_column : 9
    <10d>   DW_AT_sibling     : <0x222>
 <2><111>: Abbrev Number: 4 (DW_TAG_member)
    <112>   DW_AT_name        : CR1
    <116>   DW_AT_decl_file   : 4
    <116>   DW_AT_decl_line   : 800
    <118>   DW_AT_decl_column : 17
    <118>   DW_AT_type        : <0xa0>
    <11c>   DW_AT_data_member_location: 0
 <2><11d>: Abbrev Number: 4 (DW_TAG_member)
    <11e>   DW_AT_name        : CR2
    <122>   DW_AT_decl_file   : 4
    <122>   DW_AT_decl_line   : 801
    <124>   DW_AT_decl_column : 17
    <124>   DW_AT_type        : <0xa0>
    <128>   DW_AT_data_member_location: 4
 <2><129>: Abbrev Number: 3 (DW_TAG_member)
    <12a>   DW_AT_name        : (indirect string, offset: 0x3ce46): SMCR
    <12e>   DW_AT_decl_file   : 4
    <12f>   DW_AT_decl_line   : 802
    <131>   DW_AT_decl_column : 17
    <132>   DW_AT_type        : <0xa0>
    <136>   DW_AT_data_member_location: 8
 <2><137>: Abbrev Number: 3 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0x4325b): DIER
    <13c>   DW_AT_decl_file   : 4
    <13d>   DW_AT_decl_line   : 803
    <13f>   DW_AT_decl_column : 17
    <140>   DW_AT_type        : <0xa0>
    <144>   DW_AT_data_member_location: 12
 <2><145>: Abbrev Number: 4 (DW_TAG_member)
    <146>   DW_AT_name        : SR
    <149>   DW_AT_decl_file   : 4
    <149>   DW_AT_decl_line   : 804
    <14b>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xa0>
    <14f>   DW_AT_data_member_location: 16
 <2><150>: Abbrev Number: 4 (DW_TAG_member)
    <151>   DW_AT_name        : EGR
    <155>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 805
    <157>   DW_AT_decl_column : 17
    <157>   DW_AT_type        : <0xa0>
    <15b>   DW_AT_data_member_location: 20
 <2><15c>: Abbrev Number: 3 (DW_TAG_member)
    <15d>   DW_AT_name        : (indirect string, offset: 0xbecdb): CCMR1
    <161>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 806
    <164>   DW_AT_decl_column : 17
    <165>   DW_AT_type        : <0xa0>
    <169>   DW_AT_data_member_location: 24
 <2><16a>: Abbrev Number: 3 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0x52f27): CCMR2
    <16f>   DW_AT_decl_file   : 4
    <170>   DW_AT_decl_line   : 807
    <172>   DW_AT_decl_column : 17
    <173>   DW_AT_type        : <0xa0>
    <177>   DW_AT_data_member_location: 28
 <2><178>: Abbrev Number: 3 (DW_TAG_member)
    <179>   DW_AT_name        : (indirect string, offset: 0x329cb): CCER
    <17d>   DW_AT_decl_file   : 4
    <17e>   DW_AT_decl_line   : 808
    <180>   DW_AT_decl_column : 17
    <181>   DW_AT_type        : <0xa0>
    <185>   DW_AT_data_member_location: 32
 <2><186>: Abbrev Number: 4 (DW_TAG_member)
    <187>   DW_AT_name        : CNT
    <18b>   DW_AT_decl_file   : 4
    <18b>   DW_AT_decl_line   : 809
    <18d>   DW_AT_decl_column : 17
    <18d>   DW_AT_type        : <0xa0>
    <191>   DW_AT_data_member_location: 36
 <2><192>: Abbrev Number: 4 (DW_TAG_member)
    <193>   DW_AT_name        : PSC
    <197>   DW_AT_decl_file   : 4
    <197>   DW_AT_decl_line   : 810
    <199>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0xa0>
    <19d>   DW_AT_data_member_location: 40
 <2><19e>: Abbrev Number: 4 (DW_TAG_member)
    <19f>   DW_AT_name        : ARR
    <1a3>   DW_AT_decl_file   : 4
    <1a3>   DW_AT_decl_line   : 811
    <1a5>   DW_AT_decl_column : 17
    <1a5>   DW_AT_type        : <0xa0>
    <1a9>   DW_AT_data_member_location: 44
 <2><1aa>: Abbrev Number: 4 (DW_TAG_member)
    <1ab>   DW_AT_name        : RCR
    <1af>   DW_AT_decl_file   : 4
    <1af>   DW_AT_decl_line   : 812
    <1b1>   DW_AT_decl_column : 17
    <1b1>   DW_AT_type        : <0xa0>
    <1b5>   DW_AT_data_member_location: 48
 <2><1b6>: Abbrev Number: 3 (DW_TAG_member)
    <1b7>   DW_AT_name        : (indirect string, offset: 0x18ec4): CCR1
    <1bb>   DW_AT_decl_file   : 4
    <1bc>   DW_AT_decl_line   : 813
    <1be>   DW_AT_decl_column : 17
    <1bf>   DW_AT_type        : <0xa0>
    <1c3>   DW_AT_data_member_location: 52
 <2><1c4>: Abbrev Number: 3 (DW_TAG_member)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x570fe): CCR2
    <1c9>   DW_AT_decl_file   : 4
    <1ca>   DW_AT_decl_line   : 814
    <1cc>   DW_AT_decl_column : 17
    <1cd>   DW_AT_type        : <0xa0>
    <1d1>   DW_AT_data_member_location: 56
 <2><1d2>: Abbrev Number: 3 (DW_TAG_member)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x9fc55): CCR3
    <1d7>   DW_AT_decl_file   : 4
    <1d8>   DW_AT_decl_line   : 815
    <1da>   DW_AT_decl_column : 17
    <1db>   DW_AT_type        : <0xa0>
    <1df>   DW_AT_data_member_location: 60
 <2><1e0>: Abbrev Number: 3 (DW_TAG_member)
    <1e1>   DW_AT_name        : (indirect string, offset: 0xcb75): CCR4
    <1e5>   DW_AT_decl_file   : 4
    <1e6>   DW_AT_decl_line   : 816
    <1e8>   DW_AT_decl_column : 17
    <1e9>   DW_AT_type        : <0xa0>
    <1ed>   DW_AT_data_member_location: 64
 <2><1ee>: Abbrev Number: 3 (DW_TAG_member)
    <1ef>   DW_AT_name        : (indirect string, offset: 0x8eafa): BDTR
    <1f3>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 817
    <1f6>   DW_AT_decl_column : 17
    <1f7>   DW_AT_type        : <0xa0>
    <1fb>   DW_AT_data_member_location: 68
 <2><1fc>: Abbrev Number: 4 (DW_TAG_member)
    <1fd>   DW_AT_name        : DCR
    <201>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 818
    <203>   DW_AT_decl_column : 17
    <203>   DW_AT_type        : <0xa0>
    <207>   DW_AT_data_member_location: 72
 <2><208>: Abbrev Number: 3 (DW_TAG_member)
    <209>   DW_AT_name        : (indirect string, offset: 0xb3b11): DMAR
    <20d>   DW_AT_decl_file   : 4
    <20e>   DW_AT_decl_line   : 819
    <210>   DW_AT_decl_column : 17
    <211>   DW_AT_type        : <0xa0>
    <215>   DW_AT_data_member_location: 76
 <2><216>: Abbrev Number: 4 (DW_TAG_member)
    <217>   DW_AT_name        : OR
    <21a>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 820
    <21c>   DW_AT_decl_column : 17
    <21c>   DW_AT_type        : <0xa0>
    <220>   DW_AT_data_member_location: 80
 <2><221>: Abbrev Number: 0
 <1><222>: Abbrev Number: 8 (DW_TAG_typedef)
    <223>   DW_AT_name        : (indirect string, offset: 0xc60aa): TIM_TypeDef
    <227>   DW_AT_decl_file   : 4
    <228>   DW_AT_decl_line   : 821
    <22a>   DW_AT_decl_column : 3
    <22a>   DW_AT_type        : <0x108>
 <1><22e>: Abbrev Number: 5 (DW_TAG_base_type)
    <22f>   DW_AT_byte_size   : 8
    <230>   DW_AT_encoding    : 4	(float)
    <231>   DW_AT_name        : (indirect string, offset: 0xddcb3): long double
 <1><235>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <236>   DW_AT_encoding    : 7	(unsigned)
    <236>   DW_AT_byte_size   : 1
    <236>   DW_AT_type        : <0x31>
    <23a>   DW_AT_decl_file   : 5
    <23b>   DW_AT_decl_line   : 39
    <23c>   DW_AT_decl_column : 1
    <23c>   DW_AT_sibling     : <0x259>
 <2><240>: Abbrev Number: 2 (DW_TAG_enumerator)
    <241>   DW_AT_name        : (indirect string, offset: 0x464e5): HAL_OK
    <245>   DW_AT_const_value : 0
 <2><246>: Abbrev Number: 2 (DW_TAG_enumerator)
    <247>   DW_AT_name        : (indirect string, offset: 0x83000): HAL_ERROR
    <24b>   DW_AT_const_value : 1
 <2><24c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <24d>   DW_AT_name        : (indirect string, offset: 0x24531): HAL_BUSY
    <251>   DW_AT_const_value : 2
 <2><252>: Abbrev Number: 2 (DW_TAG_enumerator)
    <253>   DW_AT_name        : (indirect string, offset: 0x3cd2f): HAL_TIMEOUT
    <257>   DW_AT_const_value : 3
 <2><258>: Abbrev Number: 0
 <1><259>: Abbrev Number: 6 (DW_TAG_typedef)
    <25a>   DW_AT_name        : (indirect string, offset: 0x252b): HAL_StatusTypeDef
    <25e>   DW_AT_decl_file   : 5
    <25f>   DW_AT_decl_line   : 44
    <260>   DW_AT_decl_column : 3
    <261>   DW_AT_type        : <0x235>
 <1><265>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <266>   DW_AT_encoding    : 7	(unsigned)
    <266>   DW_AT_byte_size   : 1
    <266>   DW_AT_type        : <0x31>
    <26a>   DW_AT_decl_file   : 5
    <26b>   DW_AT_decl_line   : 50
    <26c>   DW_AT_decl_column : 1
    <26c>   DW_AT_sibling     : <0x27d>
 <2><270>: Abbrev Number: 2 (DW_TAG_enumerator)
    <271>   DW_AT_name        : (indirect string, offset: 0x9ab10): HAL_UNLOCKED
    <275>   DW_AT_const_value : 0
 <2><276>: Abbrev Number: 2 (DW_TAG_enumerator)
    <277>   DW_AT_name        : (indirect string, offset: 0xd15fe): HAL_LOCKED
    <27b>   DW_AT_const_value : 1
 <2><27c>: Abbrev Number: 0
 <1><27d>: Abbrev Number: 6 (DW_TAG_typedef)
    <27e>   DW_AT_name        : (indirect string, offset: 0x7b9e3): HAL_LockTypeDef
    <282>   DW_AT_decl_file   : 5
    <283>   DW_AT_decl_line   : 53
    <284>   DW_AT_decl_column : 3
    <285>   DW_AT_type        : <0x265>
 <1><289>: Abbrev Number: 18 (DW_TAG_structure_type)
    <28a>   DW_AT_byte_size   : 48
    <28b>   DW_AT_decl_file   : 6
    <28c>   DW_AT_decl_line   : 48
    <28d>   DW_AT_decl_column : 9
    <28d>   DW_AT_sibling     : <0x32e>
 <2><291>: Abbrev Number: 1 (DW_TAG_member)
    <292>   DW_AT_name        : (indirect string, offset: 0x6cb53): Channel
    <296>   DW_AT_decl_file   : 6
    <297>   DW_AT_decl_line   : 50
    <298>   DW_AT_decl_column : 12
    <299>   DW_AT_type        : <0x94>
    <29d>   DW_AT_data_member_location: 0
 <2><29e>: Abbrev Number: 1 (DW_TAG_member)
    <29f>   DW_AT_name        : (indirect string, offset: 0xe1cfd): Direction
    <2a3>   DW_AT_decl_file   : 6
    <2a4>   DW_AT_decl_line   : 53
    <2a5>   DW_AT_decl_column : 12
    <2a6>   DW_AT_type        : <0x94>
    <2aa>   DW_AT_data_member_location: 4
 <2><2ab>: Abbrev Number: 1 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0xd79a): PeriphInc
    <2b0>   DW_AT_decl_file   : 6
    <2b1>   DW_AT_decl_line   : 57
    <2b2>   DW_AT_decl_column : 12
    <2b3>   DW_AT_type        : <0x94>
    <2b7>   DW_AT_data_member_location: 8
 <2><2b8>: Abbrev Number: 1 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x20840): MemInc
    <2bd>   DW_AT_decl_file   : 6
    <2be>   DW_AT_decl_line   : 60
    <2bf>   DW_AT_decl_column : 12
    <2c0>   DW_AT_type        : <0x94>
    <2c4>   DW_AT_data_member_location: 12
 <2><2c5>: Abbrev Number: 1 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x679c1): PeriphDataAlignment
    <2ca>   DW_AT_decl_file   : 6
    <2cb>   DW_AT_decl_line   : 63
    <2cc>   DW_AT_decl_column : 12
    <2cd>   DW_AT_type        : <0x94>
    <2d1>   DW_AT_data_member_location: 16
 <2><2d2>: Abbrev Number: 1 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xbcff7): MemDataAlignment
    <2d7>   DW_AT_decl_file   : 6
    <2d8>   DW_AT_decl_line   : 66
    <2d9>   DW_AT_decl_column : 12
    <2da>   DW_AT_type        : <0x94>
    <2de>   DW_AT_data_member_location: 20
 <2><2df>: Abbrev Number: 1 (DW_TAG_member)
    <2e0>   DW_AT_name        : (indirect string, offset: 0xe08da): Mode
    <2e4>   DW_AT_decl_file   : 6
    <2e5>   DW_AT_decl_line   : 69
    <2e6>   DW_AT_decl_column : 12
    <2e7>   DW_AT_type        : <0x94>
    <2eb>   DW_AT_data_member_location: 24
 <2><2ec>: Abbrev Number: 1 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0xe122a): Priority
    <2f1>   DW_AT_decl_file   : 6
    <2f2>   DW_AT_decl_line   : 74
    <2f3>   DW_AT_decl_column : 12
    <2f4>   DW_AT_type        : <0x94>
    <2f8>   DW_AT_data_member_location: 28
 <2><2f9>: Abbrev Number: 1 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x599ab): FIFOMode
    <2fe>   DW_AT_decl_file   : 6
    <2ff>   DW_AT_decl_line   : 77
    <300>   DW_AT_decl_column : 12
    <301>   DW_AT_type        : <0x94>
    <305>   DW_AT_data_member_location: 32
 <2><306>: Abbrev Number: 1 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0x9f19d): FIFOThreshold
    <30b>   DW_AT_decl_file   : 6
    <30c>   DW_AT_decl_line   : 82
    <30d>   DW_AT_decl_column : 12
    <30e>   DW_AT_type        : <0x94>
    <312>   DW_AT_data_member_location: 36
 <2><313>: Abbrev Number: 1 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0x9d126): MemBurst
    <318>   DW_AT_decl_file   : 6
    <319>   DW_AT_decl_line   : 85
    <31a>   DW_AT_decl_column : 12
    <31b>   DW_AT_type        : <0x94>
    <31f>   DW_AT_data_member_location: 40
 <2><320>: Abbrev Number: 1 (DW_TAG_member)
    <321>   DW_AT_name        : (indirect string, offset: 0x4735f): PeriphBurst
    <325>   DW_AT_decl_file   : 6
    <326>   DW_AT_decl_line   : 91
    <327>   DW_AT_decl_column : 12
    <328>   DW_AT_type        : <0x94>
    <32c>   DW_AT_data_member_location: 44
 <2><32d>: Abbrev Number: 0
 <1><32e>: Abbrev Number: 6 (DW_TAG_typedef)
    <32f>   DW_AT_name        : (indirect string, offset: 0x37cb6): DMA_InitTypeDef
    <333>   DW_AT_decl_file   : 6
    <334>   DW_AT_decl_line   : 96
    <335>   DW_AT_decl_column : 2
    <336>   DW_AT_type        : <0x289>
 <1><33a>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <33b>   DW_AT_encoding    : 7	(unsigned)
    <33b>   DW_AT_byte_size   : 1
    <33b>   DW_AT_type        : <0x31>
    <33f>   DW_AT_decl_file   : 6
    <340>   DW_AT_decl_line   : 103
    <341>   DW_AT_decl_column : 1
    <341>   DW_AT_sibling     : <0x36a>
 <2><345>: Abbrev Number: 2 (DW_TAG_enumerator)
    <346>   DW_AT_name        : (indirect string, offset: 0x9c0c2): HAL_DMA_STATE_RESET
    <34a>   DW_AT_const_value : 0
 <2><34b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <34c>   DW_AT_name        : (indirect string, offset: 0x391ba): HAL_DMA_STATE_READY
    <350>   DW_AT_const_value : 1
 <2><351>: Abbrev Number: 2 (DW_TAG_enumerator)
    <352>   DW_AT_name        : (indirect string, offset: 0x90c14): HAL_DMA_STATE_BUSY
    <356>   DW_AT_const_value : 2
 <2><357>: Abbrev Number: 2 (DW_TAG_enumerator)
    <358>   DW_AT_name        : (indirect string, offset: 0xcdeee): HAL_DMA_STATE_TIMEOUT
    <35c>   DW_AT_const_value : 3
 <2><35d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <35e>   DW_AT_name        : (indirect string, offset: 0xb2fa9): HAL_DMA_STATE_ERROR
    <362>   DW_AT_const_value : 4
 <2><363>: Abbrev Number: 2 (DW_TAG_enumerator)
    <364>   DW_AT_name        : (indirect string, offset: 0x2f63b): HAL_DMA_STATE_ABORT
    <368>   DW_AT_const_value : 5
 <2><369>: Abbrev Number: 0
 <1><36a>: Abbrev Number: 6 (DW_TAG_typedef)
    <36b>   DW_AT_name        : (indirect string, offset: 0xbc35d): HAL_DMA_StateTypeDef
    <36f>   DW_AT_decl_file   : 6
    <370>   DW_AT_decl_line   : 110
    <371>   DW_AT_decl_column : 2
    <372>   DW_AT_type        : <0x33a>
 <1><376>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <377>   DW_AT_type        : <0x36a>
 <1><37b>: Abbrev Number: 23 (DW_TAG_structure_type)
    <37c>   DW_AT_name        : (indirect string, offset: 0xb1f4c): __DMA_HandleTypeDef
    <380>   DW_AT_byte_size   : 96
    <381>   DW_AT_decl_file   : 6
    <382>   DW_AT_decl_line   : 138
    <383>   DW_AT_decl_column : 16
    <384>   DW_AT_sibling     : <0x43f>
 <2><388>: Abbrev Number: 1 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0xca2f0): Instance
    <38d>   DW_AT_decl_file   : 6
    <38e>   DW_AT_decl_line   : 140
    <38f>   DW_AT_decl_column : 31
    <390>   DW_AT_type        : <0x43f>
    <394>   DW_AT_data_member_location: 0
 <2><395>: Abbrev Number: 1 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0xd8d29): Init
    <39a>   DW_AT_decl_file   : 6
    <39b>   DW_AT_decl_line   : 142
    <39c>   DW_AT_decl_column : 30
    <39d>   DW_AT_type        : <0x32e>
    <3a1>   DW_AT_data_member_location: 4
 <2><3a2>: Abbrev Number: 1 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x95183): Lock
    <3a7>   DW_AT_decl_file   : 6
    <3a8>   DW_AT_decl_line   : 144
    <3a9>   DW_AT_decl_column : 30
    <3aa>   DW_AT_type        : <0x27d>
    <3ae>   DW_AT_data_member_location: 52
 <2><3af>: Abbrev Number: 1 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0xdc687): State
    <3b4>   DW_AT_decl_file   : 6
    <3b5>   DW_AT_decl_line   : 146
    <3b6>   DW_AT_decl_column : 30
    <3b7>   DW_AT_type        : <0x376>
    <3bb>   DW_AT_data_member_location: 53
 <2><3bc>: Abbrev Number: 1 (DW_TAG_member)
    <3bd>   DW_AT_name        : (indirect string, offset: 0xc70a5): Parent
    <3c1>   DW_AT_decl_file   : 6
    <3c2>   DW_AT_decl_line   : 148
    <3c3>   DW_AT_decl_column : 31
    <3c4>   DW_AT_type        : <0x444>
    <3c8>   DW_AT_data_member_location: 56
 <2><3c9>: Abbrev Number: 1 (DW_TAG_member)
    <3ca>   DW_AT_name        : (indirect string, offset: 0xd05e2): XferCpltCallback
    <3ce>   DW_AT_decl_file   : 6
    <3cf>   DW_AT_decl_line   : 150
    <3d0>   DW_AT_decl_column : 33
    <3d1>   DW_AT_type        : <0x456>
    <3d5>   DW_AT_data_member_location: 60
 <2><3d6>: Abbrev Number: 1 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0xa294a): XferHalfCpltCallback
    <3db>   DW_AT_decl_file   : 6
    <3dc>   DW_AT_decl_line   : 152
    <3dd>   DW_AT_decl_column : 33
    <3de>   DW_AT_type        : <0x456>
    <3e2>   DW_AT_data_member_location: 64
 <2><3e3>: Abbrev Number: 1 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x7ae14): XferM1CpltCallback
    <3e8>   DW_AT_decl_file   : 6
    <3e9>   DW_AT_decl_line   : 154
    <3ea>   DW_AT_decl_column : 33
    <3eb>   DW_AT_type        : <0x456>
    <3ef>   DW_AT_data_member_location: 68
 <2><3f0>: Abbrev Number: 1 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x64465): XferM1HalfCpltCallback
    <3f5>   DW_AT_decl_file   : 6
    <3f6>   DW_AT_decl_line   : 156
    <3f7>   DW_AT_decl_column : 33
    <3f8>   DW_AT_type        : <0x456>
    <3fc>   DW_AT_data_member_location: 72
 <2><3fd>: Abbrev Number: 1 (DW_TAG_member)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x1dbbb): XferErrorCallback
    <402>   DW_AT_decl_file   : 6
    <403>   DW_AT_decl_line   : 158
    <404>   DW_AT_decl_column : 33
    <405>   DW_AT_type        : <0x456>
    <409>   DW_AT_data_member_location: 76
 <2><40a>: Abbrev Number: 1 (DW_TAG_member)
    <40b>   DW_AT_name        : (indirect string, offset: 0xc34e3): XferAbortCallback
    <40f>   DW_AT_decl_file   : 6
    <410>   DW_AT_decl_line   : 160
    <411>   DW_AT_decl_column : 33
    <412>   DW_AT_type        : <0x456>
    <416>   DW_AT_data_member_location: 80
 <2><417>: Abbrev Number: 1 (DW_TAG_member)
    <418>   DW_AT_name        : (indirect string, offset: 0xcc65a): ErrorCode
    <41c>   DW_AT_decl_file   : 6
    <41d>   DW_AT_decl_line   : 162
    <41e>   DW_AT_decl_column : 30
    <41f>   DW_AT_type        : <0xa0>
    <423>   DW_AT_data_member_location: 84
 <2><424>: Abbrev Number: 1 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x5d280): StreamBaseAddress
    <429>   DW_AT_decl_file   : 6
    <42a>   DW_AT_decl_line   : 164
    <42b>   DW_AT_decl_column : 30
    <42c>   DW_AT_type        : <0x94>
    <430>   DW_AT_data_member_location: 88
 <2><431>: Abbrev Number: 1 (DW_TAG_member)
    <432>   DW_AT_name        : (indirect string, offset: 0xafbfc): StreamIndex
    <436>   DW_AT_decl_file   : 6
    <437>   DW_AT_decl_line   : 166
    <438>   DW_AT_decl_column : 30
    <439>   DW_AT_type        : <0x94>
    <43d>   DW_AT_data_member_location: 92
 <2><43e>: Abbrev Number: 0
 <1><43f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <440>   DW_AT_byte_size   : 4
    <440>   DW_AT_type        : <0xfc>
 <1><444>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <445>   DW_AT_byte_size   : 4
 <1><446>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <447>   DW_AT_prototyped  : 1
    <447>   DW_AT_sibling     : <0x451>
 <2><44b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <44c>   DW_AT_type        : <0x451>
 <2><450>: Abbrev Number: 0
 <1><451>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <452>   DW_AT_byte_size   : 4
    <452>   DW_AT_type        : <0x37b>
 <1><456>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <457>   DW_AT_byte_size   : 4
    <457>   DW_AT_type        : <0x446>
 <1><45b>: Abbrev Number: 6 (DW_TAG_typedef)
    <45c>   DW_AT_name        : (indirect string, offset: 0xb1f4e): DMA_HandleTypeDef
    <460>   DW_AT_decl_file   : 6
    <461>   DW_AT_decl_line   : 168
    <462>   DW_AT_decl_column : 2
    <463>   DW_AT_type        : <0x37b>
 <1><467>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <468>   DW_AT_byte_size   : 4
    <468>   DW_AT_type        : <0x45b>
 <1><46c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <46d>   DW_AT_byte_size   : 24
    <46e>   DW_AT_decl_file   : 7
    <46f>   DW_AT_decl_line   : 46
    <470>   DW_AT_decl_column : 9
    <470>   DW_AT_sibling     : <0x4c3>
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xe2980): Prescaler
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 48
    <47b>   DW_AT_decl_column : 12
    <47c>   DW_AT_type        : <0x94>
    <480>   DW_AT_data_member_location: 0
 <2><481>: Abbrev Number: 1 (DW_TAG_member)
    <482>   DW_AT_name        : (indirect string, offset: 0xbdedd): CounterMode
    <486>   DW_AT_decl_file   : 7
    <487>   DW_AT_decl_line   : 51
    <488>   DW_AT_decl_column : 12
    <489>   DW_AT_type        : <0x94>
    <48d>   DW_AT_data_member_location: 4
 <2><48e>: Abbrev Number: 1 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0xa31aa): Period
    <493>   DW_AT_decl_file   : 7
    <494>   DW_AT_decl_line   : 54
    <495>   DW_AT_decl_column : 12
    <496>   DW_AT_type        : <0x94>
    <49a>   DW_AT_data_member_location: 8
 <2><49b>: Abbrev Number: 1 (DW_TAG_member)
    <49c>   DW_AT_name        : (indirect string, offset: 0x547f7): ClockDivision
    <4a0>   DW_AT_decl_file   : 7
    <4a1>   DW_AT_decl_line   : 58
    <4a2>   DW_AT_decl_column : 12
    <4a3>   DW_AT_type        : <0x94>
    <4a7>   DW_AT_data_member_location: 12
 <2><4a8>: Abbrev Number: 1 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x924cf): RepetitionCounter
    <4ad>   DW_AT_decl_file   : 7
    <4ae>   DW_AT_decl_line   : 61
    <4af>   DW_AT_decl_column : 12
    <4b0>   DW_AT_type        : <0x94>
    <4b4>   DW_AT_data_member_location: 16
 <2><4b5>: Abbrev Number: 1 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0xc116d): AutoReloadPreload
    <4ba>   DW_AT_decl_file   : 7
    <4bb>   DW_AT_decl_line   : 72
    <4bc>   DW_AT_decl_column : 12
    <4bd>   DW_AT_type        : <0x94>
    <4c1>   DW_AT_data_member_location: 20
 <2><4c2>: Abbrev Number: 0
 <1><4c3>: Abbrev Number: 6 (DW_TAG_typedef)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x47ca6): TIM_Base_InitTypeDef
    <4c8>   DW_AT_decl_file   : 7
    <4c9>   DW_AT_decl_line   : 74
    <4ca>   DW_AT_decl_column : 3
    <4cb>   DW_AT_type        : <0x46c>
 <1><4cf>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <4d0>   DW_AT_encoding    : 7	(unsigned)
    <4d0>   DW_AT_byte_size   : 1
    <4d0>   DW_AT_type        : <0x31>
    <4d4>   DW_AT_decl_file   : 7
    <4d4>   DW_AT_decl_line   : 291
    <4d6>   DW_AT_decl_column : 1
    <4d6>   DW_AT_sibling     : <0x4f9>
 <2><4da>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4db>   DW_AT_name        : (indirect string, offset: 0x835f8): HAL_TIM_STATE_RESET
    <4df>   DW_AT_const_value : 0
 <2><4e0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x728a): HAL_TIM_STATE_READY
    <4e5>   DW_AT_const_value : 1
 <2><4e6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x3461b): HAL_TIM_STATE_BUSY
    <4eb>   DW_AT_const_value : 2
 <2><4ec>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4ed>   DW_AT_name        : (indirect string, offset: 0xaead7): HAL_TIM_STATE_TIMEOUT
    <4f1>   DW_AT_const_value : 3
 <2><4f2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x8154d): HAL_TIM_STATE_ERROR
    <4f7>   DW_AT_const_value : 4
 <2><4f8>: Abbrev Number: 0
 <1><4f9>: Abbrev Number: 8 (DW_TAG_typedef)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x891b1): HAL_TIM_StateTypeDef
    <4fe>   DW_AT_decl_file   : 7
    <4ff>   DW_AT_decl_line   : 297
    <501>   DW_AT_decl_column : 3
    <501>   DW_AT_type        : <0x4cf>
 <1><505>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <506>   DW_AT_type        : <0x4f9>
 <1><50a>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <50b>   DW_AT_encoding    : 7	(unsigned)
    <50b>   DW_AT_byte_size   : 1
    <50b>   DW_AT_type        : <0x31>
    <50f>   DW_AT_decl_file   : 7
    <50f>   DW_AT_decl_line   : 303
    <511>   DW_AT_decl_column : 1
    <511>   DW_AT_sibling     : <0x528>
 <2><515>: Abbrev Number: 2 (DW_TAG_enumerator)
    <516>   DW_AT_name        : (indirect string, offset: 0x9390f): HAL_TIM_CHANNEL_STATE_RESET
    <51a>   DW_AT_const_value : 0
 <2><51b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <51c>   DW_AT_name        : (indirect string, offset: 0x7b15f): HAL_TIM_CHANNEL_STATE_READY
    <520>   DW_AT_const_value : 1
 <2><521>: Abbrev Number: 2 (DW_TAG_enumerator)
    <522>   DW_AT_name        : (indirect string, offset: 0x6461d): HAL_TIM_CHANNEL_STATE_BUSY
    <526>   DW_AT_const_value : 2
 <2><527>: Abbrev Number: 0
 <1><528>: Abbrev Number: 8 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x2ba76): HAL_TIM_ChannelStateTypeDef
    <52d>   DW_AT_decl_file   : 7
    <52e>   DW_AT_decl_line   : 307
    <530>   DW_AT_decl_column : 3
    <530>   DW_AT_type        : <0x50a>
 <1><534>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <535>   DW_AT_type        : <0x528>
 <1><539>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <53a>   DW_AT_encoding    : 7	(unsigned)
    <53a>   DW_AT_byte_size   : 1
    <53a>   DW_AT_type        : <0x31>
    <53e>   DW_AT_decl_file   : 7
    <53e>   DW_AT_decl_line   : 313
    <540>   DW_AT_decl_column : 1
    <540>   DW_AT_sibling     : <0x557>
 <2><544>: Abbrev Number: 2 (DW_TAG_enumerator)
    <545>   DW_AT_name        : (indirect string, offset: 0x41d9): HAL_DMA_BURST_STATE_RESET
    <549>   DW_AT_const_value : 0
 <2><54a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <54b>   DW_AT_name        : (indirect string, offset: 0x735d6): HAL_DMA_BURST_STATE_READY
    <54f>   DW_AT_const_value : 1
 <2><550>: Abbrev Number: 2 (DW_TAG_enumerator)
    <551>   DW_AT_name        : (indirect string, offset: 0x46428): HAL_DMA_BURST_STATE_BUSY
    <555>   DW_AT_const_value : 2
 <2><556>: Abbrev Number: 0
 <1><557>: Abbrev Number: 8 (DW_TAG_typedef)
    <558>   DW_AT_name        : (indirect string, offset: 0x1bfb1): HAL_TIM_DMABurstStateTypeDef
    <55c>   DW_AT_decl_file   : 7
    <55d>   DW_AT_decl_line   : 317
    <55f>   DW_AT_decl_column : 3
    <55f>   DW_AT_type        : <0x539>
 <1><563>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <564>   DW_AT_type        : <0x557>
 <1><568>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <569>   DW_AT_encoding    : 7	(unsigned)
    <569>   DW_AT_byte_size   : 1
    <569>   DW_AT_type        : <0x31>
    <56d>   DW_AT_decl_file   : 7
    <56d>   DW_AT_decl_line   : 323
    <56f>   DW_AT_decl_column : 1
    <56f>   DW_AT_sibling     : <0x592>
 <2><573>: Abbrev Number: 2 (DW_TAG_enumerator)
    <574>   DW_AT_name        : (indirect string, offset: 0x75963): HAL_TIM_ACTIVE_CHANNEL_1
    <578>   DW_AT_const_value : 1
 <2><579>: Abbrev Number: 2 (DW_TAG_enumerator)
    <57a>   DW_AT_name        : (indirect string, offset: 0x7597c): HAL_TIM_ACTIVE_CHANNEL_2
    <57e>   DW_AT_const_value : 2
 <2><57f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <580>   DW_AT_name        : (indirect string, offset: 0x75995): HAL_TIM_ACTIVE_CHANNEL_3
    <584>   DW_AT_const_value : 4
 <2><585>: Abbrev Number: 2 (DW_TAG_enumerator)
    <586>   DW_AT_name        : (indirect string, offset: 0x759ae): HAL_TIM_ACTIVE_CHANNEL_4
    <58a>   DW_AT_const_value : 8
 <2><58b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <58c>   DW_AT_name        : (indirect string, offset: 0x55951): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <590>   DW_AT_const_value : 0
 <2><591>: Abbrev Number: 0
 <1><592>: Abbrev Number: 8 (DW_TAG_typedef)
    <593>   DW_AT_name        : (indirect string, offset: 0x6cb45): HAL_TIM_ActiveChannel
    <597>   DW_AT_decl_file   : 7
    <598>   DW_AT_decl_line   : 329
    <59a>   DW_AT_decl_column : 3
    <59a>   DW_AT_type        : <0x568>
 <1><59e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <59f>   DW_AT_byte_size   : 72
    <5a0>   DW_AT_decl_file   : 7
    <5a1>   DW_AT_decl_line   : 337
    <5a3>   DW_AT_decl_column : 9
    <5a3>   DW_AT_sibling     : <0x626>
 <2><5a7>: Abbrev Number: 3 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0xca2f0): Instance
    <5ac>   DW_AT_decl_file   : 7
    <5ad>   DW_AT_decl_line   : 340
    <5af>   DW_AT_decl_column : 39
    <5b0>   DW_AT_type        : <0x626>
    <5b4>   DW_AT_data_member_location: 0
 <2><5b5>: Abbrev Number: 3 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0xd8d29): Init
    <5ba>   DW_AT_decl_file   : 7
    <5bb>   DW_AT_decl_line   : 341
    <5bd>   DW_AT_decl_column : 38
    <5be>   DW_AT_type        : <0x4c3>
    <5c2>   DW_AT_data_member_location: 4
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x6cb53): Channel
    <5c8>   DW_AT_decl_file   : 7
    <5c9>   DW_AT_decl_line   : 342
    <5cb>   DW_AT_decl_column : 38
    <5cc>   DW_AT_type        : <0x592>
    <5d0>   DW_AT_data_member_location: 28
 <2><5d1>: Abbrev Number: 3 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x7daa7): hdma
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 343
    <5d9>   DW_AT_decl_column : 39
    <5da>   DW_AT_type        : <0x62b>
    <5de>   DW_AT_data_member_location: 32
 <2><5df>: Abbrev Number: 3 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x95183): Lock
    <5e4>   DW_AT_decl_file   : 7
    <5e5>   DW_AT_decl_line   : 345
    <5e7>   DW_AT_decl_column : 38
    <5e8>   DW_AT_type        : <0x27d>
    <5ec>   DW_AT_data_member_location: 60
 <2><5ed>: Abbrev Number: 3 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0xdc687): State
    <5f2>   DW_AT_decl_file   : 7
    <5f3>   DW_AT_decl_line   : 346
    <5f5>   DW_AT_decl_column : 38
    <5f6>   DW_AT_type        : <0x505>
    <5fa>   DW_AT_data_member_location: 61
 <2><5fb>: Abbrev Number: 3 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xe2eb0): ChannelState
    <600>   DW_AT_decl_file   : 7
    <601>   DW_AT_decl_line   : 347
    <603>   DW_AT_decl_column : 38
    <604>   DW_AT_type        : <0x64b>
    <608>   DW_AT_data_member_location: 62
 <2><609>: Abbrev Number: 3 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xe34d6): ChannelNState
    <60e>   DW_AT_decl_file   : 7
    <60f>   DW_AT_decl_line   : 348
    <611>   DW_AT_decl_column : 38
    <612>   DW_AT_type        : <0x64b>
    <616>   DW_AT_data_member_location: 66
 <2><617>: Abbrev Number: 3 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0xe2a6d): DMABurstState
    <61c>   DW_AT_decl_file   : 7
    <61d>   DW_AT_decl_line   : 349
    <61f>   DW_AT_decl_column : 38
    <620>   DW_AT_type        : <0x563>
    <624>   DW_AT_data_member_location: 70
 <2><625>: Abbrev Number: 0
 <1><626>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <627>   DW_AT_byte_size   : 4
    <627>   DW_AT_type        : <0x222>
 <1><62b>: Abbrev Number: 19 (DW_TAG_array_type)
    <62c>   DW_AT_type        : <0x467>
    <630>   DW_AT_sibling     : <0x63b>
 <2><634>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <635>   DW_AT_type        : <0x81>
    <639>   DW_AT_upper_bound : 6
 <2><63a>: Abbrev Number: 0
 <1><63b>: Abbrev Number: 19 (DW_TAG_array_type)
    <63c>   DW_AT_type        : <0x534>
    <640>   DW_AT_sibling     : <0x64b>
 <2><644>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <645>   DW_AT_type        : <0x81>
    <649>   DW_AT_upper_bound : 3
 <2><64a>: Abbrev Number: 0
 <1><64b>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <64c>   DW_AT_type        : <0x63b>
 <1><650>: Abbrev Number: 8 (DW_TAG_typedef)
    <651>   DW_AT_name        : (indirect string, offset: 0x47665): TIM_HandleTypeDef
    <655>   DW_AT_decl_file   : 7
    <656>   DW_AT_decl_line   : 380
    <658>   DW_AT_decl_column : 3
    <658>   DW_AT_type        : <0x59e>
 <1><65c>: Abbrev Number: 26 (DW_TAG_variable)
    <65d>   DW_AT_name        : (indirect string, offset: 0x7fa22): htim2
    <661>   DW_AT_decl_file   : 8
    <662>   DW_AT_decl_line   : 35
    <663>   DW_AT_decl_column : 26
    <664>   DW_AT_type        : <0x650>
    <668>   DW_AT_external    : 1
    <668>   DW_AT_declaration : 1
 <1><668>: Abbrev Number: 27 (DW_TAG_subprogram)
    <669>   DW_AT_external    : 1
    <669>   DW_AT_name        : (indirect string, offset: 0x2bbb1): HAL_Delay
    <66d>   DW_AT_decl_file   : 9
    <66e>   DW_AT_decl_line   : 233
    <66f>   DW_AT_decl_column : 6
    <670>   DW_AT_prototyped  : 1
    <670>   DW_AT_declaration : 1
    <670>   DW_AT_sibling     : <0x67a>
 <2><674>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <675>   DW_AT_type        : <0x94>
 <2><679>: Abbrev Number: 0
 <1><67a>: Abbrev Number: 16 (DW_TAG_subprogram)
    <67b>   DW_AT_external    : 1
    <67b>   DW_AT_name        : (indirect string, offset: 0x21c06): HAL_TIM_PWM_Stop
    <67f>   DW_AT_decl_file   : 7
    <67f>   DW_AT_decl_line   : 1943
    <681>   DW_AT_decl_column : 19
    <681>   DW_AT_prototyped  : 1
    <681>   DW_AT_type        : <0x259>
    <685>   DW_AT_declaration : 1
    <685>   DW_AT_sibling     : <0x694>
 <2><689>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <68a>   DW_AT_type        : <0x694>
 <2><68e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <68f>   DW_AT_type        : <0x94>
 <2><693>: Abbrev Number: 0
 <1><694>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <695>   DW_AT_byte_size   : 4
    <695>   DW_AT_type        : <0x650>
 <1><699>: Abbrev Number: 16 (DW_TAG_subprogram)
    <69a>   DW_AT_external    : 1
    <69a>   DW_AT_name        : (indirect string, offset: 0xb05dd): HAL_TIM_PWM_Start
    <69e>   DW_AT_decl_file   : 7
    <69e>   DW_AT_decl_line   : 1942
    <6a0>   DW_AT_decl_column : 19
    <6a0>   DW_AT_prototyped  : 1
    <6a0>   DW_AT_type        : <0x259>
    <6a4>   DW_AT_declaration : 1
    <6a4>   DW_AT_sibling     : <0x6b3>
 <2><6a8>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <6a9>   DW_AT_type        : <0x694>
 <2><6ad>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <6ae>   DW_AT_type        : <0x94>
 <2><6b2>: Abbrev Number: 0
 <1><6b3>: Abbrev Number: 16 (DW_TAG_subprogram)
    <6b4>   DW_AT_external    : 1
    <6b4>   DW_AT_name        : (indirect string, offset: 0x9c70e): HAL_TIM_GenerateEvent
    <6b8>   DW_AT_decl_file   : 7
    <6b8>   DW_AT_decl_line   : 2062
    <6ba>   DW_AT_decl_column : 19
    <6ba>   DW_AT_prototyped  : 1
    <6ba>   DW_AT_type        : <0x259>
    <6be>   DW_AT_declaration : 1
    <6be>   DW_AT_sibling     : <0x6cd>
 <2><6c2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <6c3>   DW_AT_type        : <0x694>
 <2><6c7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <6c8>   DW_AT_type        : <0x94>
 <2><6cc>: Abbrev Number: 0
 <1><6cd>: Abbrev Number: 17 (DW_TAG_subprogram)
    <6ce>   DW_AT_external    : 1
    <6ce>   DW_AT_name        : (indirect string, offset: 0x5fdf3): Buzzer_Play
    <6d2>   DW_AT_decl_file   : 1
    <6d2>   DW_AT_decl_line   : 36
    <6d3>   DW_AT_decl_column : 6
    <6d3>   DW_AT_prototyped  : 1
    <6d3>   DW_AT_low_pc      : 0
    <6d7>   DW_AT_high_pc     : 0x90
    <6db>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6dd>   DW_AT_call_all_tail_calls: 1
    <6dd>   DW_AT_sibling     : <0x723>
 <2><6e1>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <6e2>   DW_AT_name        : (indirect string, offset: 0x2c9eb): melody
    <6e6>   DW_AT_decl_file   : 1
    <6e6>   DW_AT_decl_line   : 36
    <6e7>   DW_AT_decl_column : 29
    <6e8>   DW_AT_type        : <0x723>
    <6ec>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6ef>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x51f81): delays
    <6f4>   DW_AT_decl_file   : 1
    <6f4>   DW_AT_decl_line   : 36
    <6f5>   DW_AT_decl_column : 47
    <6f6>   DW_AT_type        : <0x723>
    <6fa>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><6fd>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <6fe>   DW_AT_name        : len
    <702>   DW_AT_decl_file   : 1
    <703>   DW_AT_decl_line   : 36
    <704>   DW_AT_decl_column : 64
    <705>   DW_AT_type        : <0x88>
    <709>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><70c>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <70d>   DW_AT_low_pc      : 0
    <711>   DW_AT_high_pc     : 0x78
 <3><715>: Abbrev Number: 13 (DW_TAG_variable)
    <716>   DW_AT_name        : i
    <718>   DW_AT_decl_file   : 1
    <718>   DW_AT_decl_line   : 37
    <719>   DW_AT_decl_column : 10
    <71a>   DW_AT_type        : <0x7a>
    <71e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><721>: Abbrev Number: 0
 <2><722>: Abbrev Number: 0
 <1><723>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <724>   DW_AT_byte_size   : 4
    <724>   DW_AT_type        : <0x94>
 <1><728>: Abbrev Number: 17 (DW_TAG_subprogram)
    <729>   DW_AT_external    : 1
    <729>   DW_AT_name        : (indirect string, offset: 0x8e6e0): Buzzer_Set_Volume
    <72d>   DW_AT_decl_file   : 1
    <72d>   DW_AT_decl_line   : 27
    <72e>   DW_AT_decl_column : 6
    <72e>   DW_AT_prototyped  : 1
    <72e>   DW_AT_low_pc      : 0x800064c
    <732>   DW_AT_high_pc     : 0x30
    <736>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <738>   DW_AT_call_all_tail_calls: 1
    <738>   DW_AT_sibling     : <0x74b>
 <2><73c>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <73d>   DW_AT_name        : (indirect string, offset: 0x29d75): volume
    <741>   DW_AT_decl_file   : 1
    <741>   DW_AT_decl_line   : 27
    <742>   DW_AT_decl_column : 34
    <743>   DW_AT_type        : <0x88>
    <747>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><74a>: Abbrev Number: 0
 <1><74b>: Abbrev Number: 17 (DW_TAG_subprogram)
    <74c>   DW_AT_external    : 1
    <74c>   DW_AT_name        : (indirect string, offset: 0x1e486): Buzzer_Set_Freq
    <750>   DW_AT_decl_file   : 1
    <750>   DW_AT_decl_line   : 10
    <751>   DW_AT_decl_column : 6
    <751>   DW_AT_prototyped  : 1
    <751>   DW_AT_low_pc      : 0x80005dc
    <755>   DW_AT_high_pc     : 0x70
    <759>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <75b>   DW_AT_call_all_tail_calls: 1
    <75b>   DW_AT_sibling     : <0x798>
 <2><75f>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <760>   DW_AT_name        : (indirect string, offset: 0xe2166): freq
    <764>   DW_AT_decl_file   : 1
    <764>   DW_AT_decl_line   : 10
    <765>   DW_AT_decl_column : 32
    <766>   DW_AT_type        : <0x88>
    <76a>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><76d>: Abbrev Number: 13 (DW_TAG_variable)
    <76e>   DW_AT_name        : psc
    <772>   DW_AT_decl_file   : 1
    <772>   DW_AT_decl_line   : 16
    <773>   DW_AT_decl_column : 11
    <774>   DW_AT_type        : <0x94>
    <778>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><77b>: Abbrev Number: 13 (DW_TAG_variable)
    <77c>   DW_AT_name        : arr
    <780>   DW_AT_decl_file   : 1
    <780>   DW_AT_decl_line   : 17
    <781>   DW_AT_decl_column : 11
    <782>   DW_AT_type        : <0x94>
    <786>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><789>: Abbrev Number: 13 (DW_TAG_variable)
    <78a>   DW_AT_name        : ccr
    <78e>   DW_AT_decl_file   : 1
    <78e>   DW_AT_decl_line   : 18
    <78f>   DW_AT_decl_column : 11
    <790>   DW_AT_type        : <0x94>
    <794>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><797>: Abbrev Number: 0
 <1><798>: Abbrev Number: 30 (DW_TAG_subprogram)
    <799>   DW_AT_external    : 1
    <799>   DW_AT_name        : (indirect string, offset: 0x6085d): Buzzer_Init
    <79d>   DW_AT_decl_file   : 1
    <79e>   DW_AT_decl_line   : 6
    <79f>   DW_AT_decl_column : 6
    <7a0>   DW_AT_prototyped  : 1
    <7a0>   DW_AT_low_pc      : 0x80005cc
    <7a4>   DW_AT_high_pc     : 0xe
    <7a8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7aa>   DW_AT_call_all_calls: 1
 <1><7aa>: Abbrev Number: 0
  Compilation Unit @ offset 0x7ab:
   Length:        0x19d (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1d6
   Pointer Size:  4
 <0><7b7>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <7b8>   DW_AT_producer    : (indirect string, offset: 0xcdcad): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <7bc>   DW_AT_language    : 29	(C11)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xd2608): ../Core/Src/fonts.c
    <7c1>   DW_AT_comp_dir    : (indirect string, offset: 0xfe60): C:/Users/nikit/STM32CubeIDE/workspace_1.19.0/EmbLab2/Debug
    <7c5>   DW_AT_stmt_list   : 0x819
    <7c9>   DW_AT_macros      : 0x21104
 <1><7cd>: Abbrev Number: 1 (DW_TAG_base_type)
    <7ce>   DW_AT_byte_size   : 1
    <7cf>   DW_AT_encoding    : 6	(signed char)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x687b8): signed char
 <1><7d4>: Abbrev Number: 2 (DW_TAG_typedef)
    <7d5>   DW_AT_name        : (indirect string, offset: 0xd25d6): __uint8_t
    <7d9>   DW_AT_decl_file   : 2
    <7da>   DW_AT_decl_line   : 43
    <7db>   DW_AT_decl_column : 24
    <7dc>   DW_AT_type        : <0x7e0>
 <1><7e0>: Abbrev Number: 1 (DW_TAG_base_type)
    <7e1>   DW_AT_byte_size   : 1
    <7e2>   DW_AT_encoding    : 8	(unsigned char)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xc9e7f): unsigned char
 <1><7e7>: Abbrev Number: 1 (DW_TAG_base_type)
    <7e8>   DW_AT_byte_size   : 2
    <7e9>   DW_AT_encoding    : 5	(signed)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x9bd12): short int
 <1><7ee>: Abbrev Number: 2 (DW_TAG_typedef)
    <7ef>   DW_AT_name        : (indirect string, offset: 0xaa9b2): __uint16_t
    <7f3>   DW_AT_decl_file   : 2
    <7f4>   DW_AT_decl_line   : 57
    <7f5>   DW_AT_decl_column : 25
    <7f6>   DW_AT_type        : <0x7fa>
 <1><7fa>: Abbrev Number: 1 (DW_TAG_base_type)
    <7fb>   DW_AT_byte_size   : 2
    <7fc>   DW_AT_encoding    : 7	(unsigned)
    <7fd>   DW_AT_name        : (indirect string, offset: 0xc875a): short unsigned int
 <1><801>: Abbrev Number: 1 (DW_TAG_base_type)
    <802>   DW_AT_byte_size   : 4
    <803>   DW_AT_encoding    : 5	(signed)
    <804>   DW_AT_name        : (indirect string, offset: 0x115e7): long int
 <1><808>: Abbrev Number: 1 (DW_TAG_base_type)
    <809>   DW_AT_byte_size   : 4
    <80a>   DW_AT_encoding    : 7	(unsigned)
    <80b>   DW_AT_name        : (indirect string, offset: 0x4f87b): long unsigned int
 <1><80f>: Abbrev Number: 1 (DW_TAG_base_type)
    <810>   DW_AT_byte_size   : 8
    <811>   DW_AT_encoding    : 5	(signed)
    <812>   DW_AT_name        : (indirect string, offset: 0x5f061): long long int
 <1><816>: Abbrev Number: 1 (DW_TAG_base_type)
    <817>   DW_AT_byte_size   : 8
    <818>   DW_AT_encoding    : 7	(unsigned)
    <819>   DW_AT_name        : (indirect string, offset: 0x2b4f1): long long unsigned int
 <1><81d>: Abbrev Number: 11 (DW_TAG_base_type)
    <81e>   DW_AT_byte_size   : 4
    <81f>   DW_AT_encoding    : 5	(signed)
    <820>   DW_AT_name        : int
 <1><824>: Abbrev Number: 1 (DW_TAG_base_type)
    <825>   DW_AT_byte_size   : 4
    <826>   DW_AT_encoding    : 7	(unsigned)
    <827>   DW_AT_name        : (indirect string, offset: 0x10bb4): unsigned int
 <1><82b>: Abbrev Number: 2 (DW_TAG_typedef)
    <82c>   DW_AT_name        : (indirect string, offset: 0xd25d8): uint8_t
    <830>   DW_AT_decl_file   : 3
    <831>   DW_AT_decl_line   : 24
    <832>   DW_AT_decl_column : 19
    <833>   DW_AT_type        : <0x7d4>
 <1><837>: Abbrev Number: 3 (DW_TAG_const_type)
    <838>   DW_AT_type        : <0x82b>
 <1><83c>: Abbrev Number: 2 (DW_TAG_typedef)
    <83d>   DW_AT_name        : (indirect string, offset: 0xd6ea2): uint16_t
    <841>   DW_AT_decl_file   : 3
    <842>   DW_AT_decl_line   : 36
    <843>   DW_AT_decl_column : 20
    <844>   DW_AT_type        : <0x7ee>
 <1><848>: Abbrev Number: 3 (DW_TAG_const_type)
    <849>   DW_AT_type        : <0x83c>
 <1><84d>: Abbrev Number: 1 (DW_TAG_base_type)
    <84e>   DW_AT_byte_size   : 8
    <84f>   DW_AT_encoding    : 4	(float)
    <850>   DW_AT_name        : (indirect string, offset: 0xddcb3): long double
 <1><854>: Abbrev Number: 12 (DW_TAG_structure_type)
    <855>   DW_AT_byte_size   : 8
    <856>   DW_AT_decl_file   : 4
    <857>   DW_AT_decl_line   : 7
    <858>   DW_AT_decl_column : 9
    <859>   DW_AT_sibling     : <0x882>
 <2><85d>: Abbrev Number: 4 (DW_TAG_member)
    <85e>   DW_AT_name        : (indirect string, offset: 0xd25c2): FontWidth
    <862>   DW_AT_decl_file   : 4
    <862>   DW_AT_decl_line   : 8
    <863>   DW_AT_decl_column : 16
    <864>   DW_AT_type        : <0x837>
    <868>   DW_AT_data_member_location: 0
 <2><869>: Abbrev Number: 4 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0xd25eb): FontHeight
    <86e>   DW_AT_decl_file   : 4
    <86e>   DW_AT_decl_line   : 9
    <86f>   DW_AT_decl_column : 10
    <870>   DW_AT_type        : <0x82b>
    <874>   DW_AT_data_member_location: 1
 <2><875>: Abbrev Number: 4 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0xe3b28): data
    <87a>   DW_AT_decl_file   : 4
    <87a>   DW_AT_decl_line   : 10
    <87b>   DW_AT_decl_column : 18
    <87c>   DW_AT_type        : <0x882>
    <880>   DW_AT_data_member_location: 4
 <2><881>: Abbrev Number: 0
 <1><882>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <883>   DW_AT_byte_size   : 4
    <884>   DW_AT_type        : <0x848>
 <1><888>: Abbrev Number: 2 (DW_TAG_typedef)
    <889>   DW_AT_name        : (indirect string, offset: 0xd261c): FontDef
    <88d>   DW_AT_decl_file   : 4
    <88e>   DW_AT_decl_line   : 11
    <88f>   DW_AT_decl_column : 3
    <890>   DW_AT_type        : <0x854>
 <1><894>: Abbrev Number: 5 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0xd25b8): Font_7x10
    <899>   DW_AT_decl_file   : 4
    <899>   DW_AT_decl_line   : 13
    <89a>   DW_AT_decl_column : 16
    <89a>   DW_AT_type        : <0x888>
    <89e>   DW_AT_external    : 1
    <89e>   DW_AT_declaration : 1
 <1><89e>: Abbrev Number: 5 (DW_TAG_variable)
    <89f>   DW_AT_name        : (indirect string, offset: 0xd25f6): Font_11x18
    <8a3>   DW_AT_decl_file   : 4
    <8a3>   DW_AT_decl_line   : 14
    <8a4>   DW_AT_decl_column : 16
    <8a4>   DW_AT_type        : <0x888>
    <8a8>   DW_AT_external    : 1
    <8a8>   DW_AT_declaration : 1
 <1><8a8>: Abbrev Number: 5 (DW_TAG_variable)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xd25e0): Font_16x26
    <8ad>   DW_AT_decl_file   : 4
    <8ad>   DW_AT_decl_line   : 15
    <8ae>   DW_AT_decl_column : 16
    <8ae>   DW_AT_type        : <0x888>
    <8b2>   DW_AT_external    : 1
    <8b2>   DW_AT_declaration : 1
 <1><8b2>: Abbrev Number: 6 (DW_TAG_array_type)
    <8b3>   DW_AT_type        : <0x848>
    <8b7>   DW_AT_sibling     : <0x8c3>
 <2><8bb>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <8bc>   DW_AT_type        : <0x824>
    <8c0>   DW_AT_upper_bound : 949
 <2><8c2>: Abbrev Number: 0
 <1><8c3>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c4>   DW_AT_type        : <0x8b2>
 <1><8c8>: Abbrev Number: 8 (DW_TAG_variable)
    <8c9>   DW_AT_name        : (indirect string, offset: 0xd2624): Font7x10
    <8cd>   DW_AT_decl_file   : 1
    <8cd>   DW_AT_decl_line   : 5
    <8ce>   DW_AT_decl_column : 23
    <8ce>   DW_AT_type        : <0x8c3>
    <8d2>   DW_AT_location    : 5 byte block: 3 7c 8f 0 8 	(DW_OP_addr: 8008f7c)
 <1><8d8>: Abbrev Number: 6 (DW_TAG_array_type)
    <8d9>   DW_AT_type        : <0x848>
    <8dd>   DW_AT_sibling     : <0x8e9>
 <2><8e1>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <8e2>   DW_AT_type        : <0x824>
    <8e6>   DW_AT_upper_bound : 1709
 <2><8e8>: Abbrev Number: 0
 <1><8e9>: Abbrev Number: 3 (DW_TAG_const_type)
    <8ea>   DW_AT_type        : <0x8d8>
 <1><8ee>: Abbrev Number: 8 (DW_TAG_variable)
    <8ef>   DW_AT_name        : (indirect string, offset: 0xd262d): Font11x18
    <8f3>   DW_AT_decl_file   : 1
    <8f3>   DW_AT_decl_line   : 103
    <8f4>   DW_AT_decl_column : 23
    <8f4>   DW_AT_type        : <0x8e9>
    <8f8>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><8fe>: Abbrev Number: 6 (DW_TAG_array_type)
    <8ff>   DW_AT_type        : <0x848>
    <903>   DW_AT_sibling     : <0x90f>
 <2><907>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <908>   DW_AT_type        : <0x824>
    <90c>   DW_AT_upper_bound : 2469
 <2><90e>: Abbrev Number: 0
 <1><90f>: Abbrev Number: 3 (DW_TAG_const_type)
    <910>   DW_AT_type        : <0x8fe>
 <1><914>: Abbrev Number: 8 (DW_TAG_variable)
    <915>   DW_AT_name        : (indirect string, offset: 0xd25cc): Font16x26
    <919>   DW_AT_decl_file   : 1
    <919>   DW_AT_decl_line   : 201
    <91a>   DW_AT_decl_column : 23
    <91a>   DW_AT_type        : <0x90f>
    <91e>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><924>: Abbrev Number: 9 (DW_TAG_variable)
    <925>   DW_AT_specification: <0x894>
    <929>   DW_AT_decl_file   : 1
    <929>   DW_AT_decl_line   : 301
    <92b>   DW_AT_decl_column : 9
    <92b>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><931>: Abbrev Number: 9 (DW_TAG_variable)
    <932>   DW_AT_specification: <0x89e>
    <936>   DW_AT_decl_file   : 1
    <936>   DW_AT_decl_line   : 302
    <938>   DW_AT_decl_column : 9
    <938>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><93e>: Abbrev Number: 9 (DW_TAG_variable)
    <93f>   DW_AT_specification: <0x8a8>
    <943>   DW_AT_decl_file   : 1
    <943>   DW_AT_decl_line   : 303
    <945>   DW_AT_decl_column : 9
    <945>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><94b>: Abbrev Number: 0
  Compilation Unit @ offset 0x94c:
   Length:        0x4b2 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x289
   Pointer Size:  4
 <0><958>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <959>   DW_AT_producer    : (indirect string, offset: 0xcdcad): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <95d>   DW_AT_language    : 29	(C11)
    <95e>   DW_AT_name        : (indirect string, offset: 0xd880f): ../Core/Src/freertos.c
    <962>   DW_AT_comp_dir    : (indirect string, offset: 0xfe60): C:/Users/nikit/STM32CubeIDE/workspace_1.19.0/EmbLab2/Debug
    <966>   DW_AT_ranges      : 0x32
    <96a>   DW_AT_low_pc      : 0
    <96e>   DW_AT_stmt_list   : 0xf6d
    <972>   DW_AT_macros      : 0x212f5
 <1><976>: Abbrev Number: 18 (DW_TAG_base_type)
    <977>   DW_AT_byte_size   : 4
    <978>   DW_AT_encoding    : 5	(signed)
    <979>   DW_AT_name        : int
 <1><97d>: Abbrev Number: 4 (DW_TAG_base_type)
    <97e>   DW_AT_byte_size   : 4
    <97f>   DW_AT_encoding    : 7	(unsigned)
    <980>   DW_AT_name        : (indirect string, offset: 0x10bb4): unsigned int
 <1><984>: Abbrev Number: 4 (DW_TAG_base_type)
    <985>   DW_AT_byte_size   : 8
    <986>   DW_AT_encoding    : 5	(signed)
    <987>   DW_AT_name        : (indirect string, offset: 0x5f061): long long int
 <1><98b>: Abbrev Number: 4 (DW_TAG_base_type)
    <98c>   DW_AT_byte_size   : 8
    <98d>   DW_AT_encoding    : 4	(float)
    <98e>   DW_AT_name        : (indirect string, offset: 0xddcb3): long double
 <1><992>: Abbrev Number: 4 (DW_TAG_base_type)
    <993>   DW_AT_byte_size   : 1
    <994>   DW_AT_encoding    : 6	(signed char)
    <995>   DW_AT_name        : (indirect string, offset: 0x687b8): signed char
 <1><999>: Abbrev Number: 3 (DW_TAG_typedef)
    <99a>   DW_AT_name        : (indirect string, offset: 0xd25d6): __uint8_t
    <99e>   DW_AT_decl_file   : 2
    <99f>   DW_AT_decl_line   : 43
    <9a0>   DW_AT_decl_column : 24
    <9a1>   DW_AT_type        : <0x9a5>
 <1><9a5>: Abbrev Number: 4 (DW_TAG_base_type)
    <9a6>   DW_AT_byte_size   : 1
    <9a7>   DW_AT_encoding    : 8	(unsigned char)
    <9a8>   DW_AT_name        : (indirect string, offset: 0xc9e7f): unsigned char
 <1><9ac>: Abbrev Number: 4 (DW_TAG_base_type)
    <9ad>   DW_AT_byte_size   : 2
    <9ae>   DW_AT_encoding    : 5	(signed)
    <9af>   DW_AT_name        : (indirect string, offset: 0x9bd12): short int
 <1><9b3>: Abbrev Number: 3 (DW_TAG_typedef)
    <9b4>   DW_AT_name        : (indirect string, offset: 0xaa9b2): __uint16_t
    <9b8>   DW_AT_decl_file   : 2
    <9b9>   DW_AT_decl_line   : 57
    <9ba>   DW_AT_decl_column : 25
    <9bb>   DW_AT_type        : <0x9bf>
 <1><9bf>: Abbrev Number: 4 (DW_TAG_base_type)
    <9c0>   DW_AT_byte_size   : 2
    <9c1>   DW_AT_encoding    : 7	(unsigned)
    <9c2>   DW_AT_name        : (indirect string, offset: 0xc875a): short unsigned int
 <1><9c6>: Abbrev Number: 4 (DW_TAG_base_type)
    <9c7>   DW_AT_byte_size   : 4
    <9c8>   DW_AT_encoding    : 5	(signed)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x115e7): long int
 <1><9cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x854dd): __uint32_t
    <9d2>   DW_AT_decl_file   : 2
    <9d3>   DW_AT_decl_line   : 79
    <9d4>   DW_AT_decl_column : 25
    <9d5>   DW_AT_type        : <0x9d9>
 <1><9d9>: Abbrev Number: 4 (DW_TAG_base_type)
    <9da>   DW_AT_byte_size   : 4
    <9db>   DW_AT_encoding    : 7	(unsigned)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x4f87b): long unsigned int
 <1><9e0>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e1>   DW_AT_byte_size   : 8
    <9e2>   DW_AT_encoding    : 7	(unsigned)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x2b4f1): long long unsigned int
 <1><9e7>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e8>   DW_AT_name        : (indirect string, offset: 0xd25d8): uint8_t
    <9ec>   DW_AT_decl_file   : 3
    <9ed>   DW_AT_decl_line   : 24
    <9ee>   DW_AT_decl_column : 19
    <9ef>   DW_AT_type        : <0x999>
 <1><9f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <9f4>   DW_AT_name        : (indirect string, offset: 0xd6ea2): uint16_t
    <9f8>   DW_AT_decl_file   : 3
    <9f9>   DW_AT_decl_line   : 36
    <9fa>   DW_AT_decl_column : 20
    <9fb>   DW_AT_type        : <0x9b3>
 <1><9ff>: Abbrev Number: 3 (DW_TAG_typedef)
    <a00>   DW_AT_name        : (indirect string, offset: 0xd6e82): uint32_t
    <a04>   DW_AT_decl_file   : 3
    <a05>   DW_AT_decl_line   : 48
    <a06>   DW_AT_decl_column : 20
    <a07>   DW_AT_type        : <0x9cd>
 <1><a0b>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <a0c>   DW_AT_byte_size   : 4
 <1><a0d>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0e>   DW_AT_name        : (indirect string, offset: 0xd6ef2): StackType_t
    <a12>   DW_AT_decl_file   : 4
    <a13>   DW_AT_decl_line   : 55
    <a14>   DW_AT_decl_column : 24
    <a15>   DW_AT_type        : <0x9ff>
 <1><a19>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1a>   DW_AT_name        : (indirect string, offset: 0xd2654): UBaseType_t
    <a1e>   DW_AT_decl_file   : 4
    <a1f>   DW_AT_decl_line   : 57
    <a20>   DW_AT_decl_column : 23
    <a21>   DW_AT_type        : <0x9d9>
 <1><a25>: Abbrev Number: 3 (DW_TAG_typedef)
    <a26>   DW_AT_name        : (indirect string, offset: 0xd5d40): TickType_t
    <a2a>   DW_AT_decl_file   : 4
    <a2b>   DW_AT_decl_line   : 63
    <a2c>   DW_AT_decl_column : 19
    <a2d>   DW_AT_type        : <0x9ff>
 <1><a31>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a32>   DW_AT_name        : (indirect string, offset: 0xd793e): xSTATIC_LIST_ITEM
    <a36>   DW_AT_byte_size   : 20
    <a37>   DW_AT_decl_file   : 5
    <a38>   DW_AT_decl_line   : 1061
    <a3a>   DW_AT_decl_column : 8
    <a3b>   DW_AT_sibling     : <0xa5c>
 <2><a3f>: Abbrev Number: 2 (DW_TAG_member)
    <a40>   DW_AT_name        : (indirect string, offset: 0xe3d05): xDummy2
    <a44>   DW_AT_decl_file   : 5
    <a45>   DW_AT_decl_line   : 1066
    <a47>   DW_AT_decl_column : 13
    <a48>   DW_AT_type        : <0xa25>
    <a4c>   DW_AT_data_member_location: 0
 <2><a4d>: Abbrev Number: 2 (DW_TAG_member)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xd4a20): pvDummy3
    <a52>   DW_AT_decl_file   : 5
    <a53>   DW_AT_decl_line   : 1067
    <a55>   DW_AT_decl_column : 8
    <a56>   DW_AT_type        : <0xa5c>
    <a5a>   DW_AT_data_member_location: 4
 <2><a5b>: Abbrev Number: 0
 <1><a5c>: Abbrev Number: 6 (DW_TAG_array_type)
    <a5d>   DW_AT_type        : <0xa0b>
    <a61>   DW_AT_sibling     : <0xa6c>
 <2><a65>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a66>   DW_AT_type        : <0x97d>
    <a6a>   DW_AT_upper_bound : 3
 <2><a6b>: Abbrev Number: 0
 <1><a6c>: Abbrev Number: 8 (DW_TAG_typedef)
    <a6d>   DW_AT_name        : (indirect string, offset: 0xd7101): StaticListItem_t
    <a71>   DW_AT_decl_file   : 5
    <a72>   DW_AT_decl_line   : 1072
    <a74>   DW_AT_decl_column : 34
    <a75>   DW_AT_type        : <0xa31>
 <1><a79>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xd5fbe): xSTATIC_TCB
    <a7e>   DW_AT_byte_size   : 84
    <a7f>   DW_AT_decl_file   : 5
    <a80>   DW_AT_decl_line   : 1112
    <a82>   DW_AT_decl_column : 16
    <a83>   DW_AT_sibling     : <0xb06>
 <2><a87>: Abbrev Number: 2 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0xd3b80): pxDummy1
    <a8c>   DW_AT_decl_file   : 5
    <a8d>   DW_AT_decl_line   : 1114
    <a8f>   DW_AT_decl_column : 11
    <a90>   DW_AT_type        : <0xa0b>
    <a94>   DW_AT_data_member_location: 0
 <2><a95>: Abbrev Number: 2 (DW_TAG_member)
    <a96>   DW_AT_name        : (indirect string, offset: 0xd39ac): xDummy3
    <a9a>   DW_AT_decl_file   : 5
    <a9b>   DW_AT_decl_line   : 1118
    <a9d>   DW_AT_decl_column : 19
    <a9e>   DW_AT_type        : <0xb06>
    <aa2>   DW_AT_data_member_location: 4
 <2><aa3>: Abbrev Number: 2 (DW_TAG_member)
    <aa4>   DW_AT_name        : (indirect string, offset: 0xd348b): uxDummy5
    <aa8>   DW_AT_decl_file   : 5
    <aa9>   DW_AT_decl_line   : 1119
    <aab>   DW_AT_decl_column : 16
    <aac>   DW_AT_type        : <0xa19>
    <ab0>   DW_AT_data_member_location: 44
 <2><ab1>: Abbrev Number: 2 (DW_TAG_member)
    <ab2>   DW_AT_name        : (indirect string, offset: 0xd3b89): pxDummy6
    <ab6>   DW_AT_decl_file   : 5
    <ab7>   DW_AT_decl_line   : 1120
    <ab9>   DW_AT_decl_column : 11
    <aba>   DW_AT_type        : <0xa0b>
    <abe>   DW_AT_data_member_location: 48
 <2><abf>: Abbrev Number: 2 (DW_TAG_member)
    <ac0>   DW_AT_name        : (indirect string, offset: 0xd4976): ucDummy7
    <ac4>   DW_AT_decl_file   : 5
    <ac5>   DW_AT_decl_line   : 1121
    <ac7>   DW_AT_decl_column : 13
    <ac8>   DW_AT_type        : <0xb16>
    <acc>   DW_AT_data_member_location: 52
 <2><acd>: Abbrev Number: 2 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0xd3d2f): uxDummy12
    <ad2>   DW_AT_decl_file   : 5
    <ad3>   DW_AT_decl_line   : 1132
    <ad5>   DW_AT_decl_column : 16
    <ad6>   DW_AT_type        : <0xb26>
    <ada>   DW_AT_data_member_location: 68
 <2><adb>: Abbrev Number: 2 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0xd3553): ulDummy18
    <ae0>   DW_AT_decl_file   : 5
    <ae1>   DW_AT_decl_line   : 1147
    <ae3>   DW_AT_decl_column : 14
    <ae4>   DW_AT_type        : <0x9ff>
    <ae8>   DW_AT_data_member_location: 76
 <2><ae9>: Abbrev Number: 2 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0xd44ef): ucDummy19
    <aee>   DW_AT_decl_file   : 5
    <aef>   DW_AT_decl_line   : 1148
    <af1>   DW_AT_decl_column : 13
    <af2>   DW_AT_type        : <0x9e7>
    <af6>   DW_AT_data_member_location: 80
 <2><af7>: Abbrev Number: 2 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0xd8041): uxDummy20
    <afc>   DW_AT_decl_file   : 5
    <afd>   DW_AT_decl_line   : 1151
    <aff>   DW_AT_decl_column : 13
    <b00>   DW_AT_type        : <0x9e7>
    <b04>   DW_AT_data_member_location: 81
 <2><b05>: Abbrev Number: 0
 <1><b06>: Abbrev Number: 6 (DW_TAG_array_type)
    <b07>   DW_AT_type        : <0xa6c>
    <b0b>   DW_AT_sibling     : <0xb16>
 <2><b0f>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <b10>   DW_AT_type        : <0x97d>
    <b14>   DW_AT_upper_bound : 1
 <2><b15>: Abbrev Number: 0
 <1><b16>: Abbrev Number: 6 (DW_TAG_array_type)
    <b17>   DW_AT_type        : <0x9e7>
    <b1b>   DW_AT_sibling     : <0xb26>
 <2><b1f>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <b20>   DW_AT_type        : <0x97d>
    <b24>   DW_AT_upper_bound : 15
 <2><b25>: Abbrev Number: 0
 <1><b26>: Abbrev Number: 6 (DW_TAG_array_type)
    <b27>   DW_AT_type        : <0xa19>
    <b2b>   DW_AT_sibling     : <0xb36>
 <2><b2f>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <b30>   DW_AT_type        : <0x97d>
    <b34>   DW_AT_upper_bound : 1
 <2><b35>: Abbrev Number: 0
 <1><b36>: Abbrev Number: 8 (DW_TAG_typedef)
    <b37>   DW_AT_name        : (indirect string, offset: 0xd57cc): StaticTask_t
    <b3b>   DW_AT_decl_file   : 5
    <b3c>   DW_AT_decl_line   : 1160
    <b3e>   DW_AT_decl_column : 3
    <b3f>   DW_AT_type        : <0xa79>
 <1><b43>: Abbrev Number: 3 (DW_TAG_typedef)
    <b44>   DW_AT_name        : (indirect string, offset: 0xd7bec): TaskHandle_t
    <b48>   DW_AT_decl_file   : 6
    <b49>   DW_AT_decl_line   : 70
    <b4a>   DW_AT_decl_column : 37
    <b4b>   DW_AT_type        : <0xb4f>
 <1><b4f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <b50>   DW_AT_byte_size   : 4
    <b50>   DW_AT_type        : <0xb54>
 <1><b54>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b55>   DW_AT_name        : (indirect string, offset: 0xd7950): tskTaskControlBlock
    <b59>   DW_AT_declaration : 1
 <1><b59>: Abbrev Number: 4 (DW_TAG_base_type)
    <b5a>   DW_AT_byte_size   : 1
    <b5b>   DW_AT_encoding    : 8	(unsigned char)
    <b5c>   DW_AT_name        : (indirect string, offset: 0xd467f): char
 <1><b60>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <b61>   DW_AT_byte_size   : 4
    <b61>   DW_AT_type        : <0xa0d>
 <1><b65>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <b66>   DW_AT_encoding    : 5	(signed)
    <b67>   DW_AT_byte_size   : 2
    <b68>   DW_AT_type        : <0x9ac>
    <b6c>   DW_AT_decl_file   : 7
    <b6c>   DW_AT_decl_line   : 172
    <b6d>   DW_AT_decl_column : 15
    <b6d>   DW_AT_sibling     : <0xba2>
 <2><b71>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b72>   DW_AT_name        : (indirect string, offset: 0xd7bb0): osPriorityIdle
    <b76>   DW_AT_const_value : -3
 <2><b77>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b78>   DW_AT_name        : (indirect string, offset: 0xd82ac): osPriorityLow
    <b7c>   DW_AT_const_value : -2
 <2><b7d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0xd866c): osPriorityBelowNormal
    <b82>   DW_AT_const_value : -1
 <2><b83>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b84>   DW_AT_name        : (indirect string, offset: 0xd767d): osPriorityNormal
    <b88>   DW_AT_const_value : 0
 <2><b89>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b8a>   DW_AT_name        : (indirect string, offset: 0xd67b1): osPriorityAboveNormal
    <b8e>   DW_AT_const_value : 1
 <2><b8f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b90>   DW_AT_name        : (indirect string, offset: 0xd3a09): osPriorityHigh
    <b94>   DW_AT_const_value : 2
 <2><b95>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b96>   DW_AT_name        : (indirect string, offset: 0xd807f): osPriorityRealtime
    <b9a>   DW_AT_const_value : 3
 <2><b9b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b9c>   DW_AT_name        : (indirect string, offset: 0xd7cc4): osPriorityError
    <ba0>   DW_AT_const_value : 132
 <2><ba1>: Abbrev Number: 0
 <1><ba2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ba3>   DW_AT_name        : (indirect string, offset: 0xe3cba): osPriority
    <ba7>   DW_AT_decl_file   : 7
    <ba8>   DW_AT_decl_line   : 181
    <ba9>   DW_AT_decl_column : 3
    <baa>   DW_AT_type        : <0xb65>
 <1><bae>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <baf>   DW_AT_encoding    : 7	(unsigned)
    <bb0>   DW_AT_byte_size   : 4
    <bb1>   DW_AT_type        : <0x97d>
    <bb5>   DW_AT_decl_file   : 7
    <bb5>   DW_AT_decl_line   : 189
    <bb6>   DW_AT_decl_column : 15
    <bb6>   DW_AT_sibling     : <0xc18>
 <2><bba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bbb>   DW_AT_name        : (indirect string, offset: 0xd7cbf): osOK
    <bbf>   DW_AT_const_value : 0
 <2><bc0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc1>   DW_AT_name        : (indirect string, offset: 0xd6efe): osEventSignal
    <bc5>   DW_AT_const_value : 8
 <2><bc6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc7>   DW_AT_name        : (indirect string, offset: 0xd2645): osEventMessage
    <bcb>   DW_AT_const_value : 16
 <2><bcc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bcd>   DW_AT_name        : (indirect string, offset: 0xd67a5): osEventMail
    <bd1>   DW_AT_const_value : 32
 <2><bd2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bd3>   DW_AT_name        : (indirect string, offset: 0xd37c8): osEventTimeout
    <bd7>   DW_AT_const_value : 64
 <2><bd8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bd9>   DW_AT_name        : (indirect string, offset: 0xd3ffa): osErrorParameter
    <bdd>   DW_AT_const_value : 128
 <2><bde>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bdf>   DW_AT_name        : (indirect string, offset: 0xd6931): osErrorResource
    <be3>   DW_AT_const_value : 129
 <2><be4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <be5>   DW_AT_name        : (indirect string, offset: 0xd6ade): osErrorTimeoutResource
    <be9>   DW_AT_const_value : 193
 <2><bea>: Abbrev Number: 1 (DW_TAG_enumerator)
    <beb>   DW_AT_name        : (indirect string, offset: 0xd40ab): osErrorISR
    <bef>   DW_AT_const_value : 130
 <2><bf0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf1>   DW_AT_name        : (indirect string, offset: 0xd3417): osErrorISRRecursive
    <bf5>   DW_AT_const_value : 131
 <2><bf6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf7>   DW_AT_name        : (indirect string, offset: 0xd2b19): osErrorPriority
    <bfb>   DW_AT_const_value : 132
 <2><bfc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bfd>   DW_AT_name        : (indirect string, offset: 0xd3833): osErrorNoMemory
    <c01>   DW_AT_const_value : 133
 <2><c02>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c03>   DW_AT_name        : (indirect string, offset: 0xd6ca7): osErrorValue
    <c07>   DW_AT_const_value : 134
 <2><c08>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c09>   DW_AT_name        : (indirect string, offset: 0xd5b48): osErrorOS
    <c0d>   DW_AT_const_value : 255
 <2><c0e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c0f>   DW_AT_name        : (indirect string, offset: 0xd4663): os_status_reserved
    <c13>   DW_AT_const_value : 0x7fffffff
 <2><c17>: Abbrev Number: 0
 <1><c18>: Abbrev Number: 3 (DW_TAG_typedef)
    <c19>   DW_AT_name        : (indirect string, offset: 0xd366f): osStatus
    <c1d>   DW_AT_decl_file   : 7
    <c1e>   DW_AT_decl_line   : 205
    <c1f>   DW_AT_decl_column : 3
    <c20>   DW_AT_type        : <0xbae>
 <1><c24>: Abbrev Number: 3 (DW_TAG_typedef)
    <c25>   DW_AT_name        : (indirect string, offset: 0xd5789): os_pthread
    <c29>   DW_AT_decl_file   : 7
    <c2a>   DW_AT_decl_line   : 228
    <c2b>   DW_AT_decl_column : 16
    <c2c>   DW_AT_type        : <0xc30>
 <1><c30>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <c31>   DW_AT_byte_size   : 4
    <c31>   DW_AT_type        : <0xc35>
 <1><c35>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <c36>   DW_AT_prototyped  : 1
    <c36>   DW_AT_sibling     : <0xc40>
 <2><c3a>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <c3b>   DW_AT_type        : <0xc40>
 <2><c3f>: Abbrev Number: 0
 <1><c40>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <c41>   DW_AT_byte_size   : 4
    <c41>   DW_AT_type        : <0xc45>
 <1><c45>: Abbrev Number: 23 (DW_TAG_const_type)
 <1><c46>: Abbrev Number: 3 (DW_TAG_typedef)
    <c47>   DW_AT_name        : (indirect string, offset: 0xd394f): osThreadId
    <c4b>   DW_AT_decl_file   : 7
    <c4c>   DW_AT_decl_line   : 238
    <c4d>   DW_AT_decl_column : 22
    <c4e>   DW_AT_type        : <0xb43>
 <1><c52>: Abbrev Number: 8 (DW_TAG_typedef)
    <c53>   DW_AT_name        : (indirect string, offset: 0xd64f4): osStaticThreadDef_t
    <c57>   DW_AT_decl_file   : 7
    <c58>   DW_AT_decl_line   : 267
    <c5a>   DW_AT_decl_column : 36
    <c5b>   DW_AT_type        : <0xb36>
 <1><c5f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c60>   DW_AT_name        : (indirect string, offset: 0xd3b72): os_thread_def
    <c64>   DW_AT_byte_size   : 28
    <c65>   DW_AT_decl_file   : 7
    <c66>   DW_AT_decl_line   : 280
    <c68>   DW_AT_decl_column : 16
    <c69>   DW_AT_sibling     : <0xcd0>
 <2><c6d>: Abbrev Number: 2 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xd7ee7): name
    <c72>   DW_AT_decl_file   : 7
    <c73>   DW_AT_decl_line   : 281
    <c75>   DW_AT_decl_column : 27
    <c76>   DW_AT_type        : <0xcd0>
    <c7a>   DW_AT_data_member_location: 0
 <2><c7b>: Abbrev Number: 2 (DW_TAG_member)
    <c7c>   DW_AT_name        : (indirect string, offset: 0xd578c): pthread
    <c80>   DW_AT_decl_file   : 7
    <c81>   DW_AT_decl_line   : 282
    <c83>   DW_AT_decl_column : 26
    <c84>   DW_AT_type        : <0xc24>
    <c88>   DW_AT_data_member_location: 4
 <2><c89>: Abbrev Number: 2 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0xd6e62): tpriority
    <c8e>   DW_AT_decl_file   : 7
    <c8f>   DW_AT_decl_line   : 283
    <c91>   DW_AT_decl_column : 26
    <c92>   DW_AT_type        : <0xba2>
    <c96>   DW_AT_data_member_location: 8
 <2><c97>: Abbrev Number: 2 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0xd50be): instances
    <c9c>   DW_AT_decl_file   : 7
    <c9d>   DW_AT_decl_line   : 284
    <c9f>   DW_AT_decl_column : 26
    <ca0>   DW_AT_type        : <0x9ff>
    <ca4>   DW_AT_data_member_location: 12
 <2><ca5>: Abbrev Number: 2 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xd2dfc): stacksize
    <caa>   DW_AT_decl_file   : 7
    <cab>   DW_AT_decl_line   : 285
    <cad>   DW_AT_decl_column : 26
    <cae>   DW_AT_type        : <0x9ff>
    <cb2>   DW_AT_data_member_location: 16
 <2><cb3>: Abbrev Number: 2 (DW_TAG_member)
    <cb4>   DW_AT_name        : (indirect string, offset: 0xd35f2): buffer
    <cb8>   DW_AT_decl_file   : 7
    <cb9>   DW_AT_decl_line   : 287
    <cbb>   DW_AT_decl_column : 27
    <cbc>   DW_AT_type        : <0xcd5>
    <cc0>   DW_AT_data_member_location: 20
 <2><cc1>: Abbrev Number: 2 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0xd537e): controlblock
    <cc6>   DW_AT_decl_file   : 7
    <cc7>   DW_AT_decl_line   : 288
    <cc9>   DW_AT_decl_column : 27
    <cca>   DW_AT_type        : <0xcda>
    <cce>   DW_AT_data_member_location: 24
 <2><ccf>: Abbrev Number: 0
 <1><cd0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd1>   DW_AT_byte_size   : 4
    <cd1>   DW_AT_type        : <0xb59>
 <1><cd5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd6>   DW_AT_byte_size   : 4
    <cd6>   DW_AT_type        : <0x9ff>
 <1><cda>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cdb>   DW_AT_byte_size   : 4
    <cdb>   DW_AT_type        : <0xc52>
 <1><cdf>: Abbrev Number: 8 (DW_TAG_typedef)
    <ce0>   DW_AT_name        : (indirect string, offset: 0xd2da4): osThreadDef_t
    <ce4>   DW_AT_decl_file   : 7
    <ce5>   DW_AT_decl_line   : 290
    <ce7>   DW_AT_decl_column : 3
    <ce8>   DW_AT_type        : <0xc5f>
 <1><cec>: Abbrev Number: 24 (DW_TAG_const_type)
    <ced>   DW_AT_type        : <0xcdf>
 <1><cf1>: Abbrev Number: 25 (DW_TAG_variable)
    <cf2>   DW_AT_name        : (indirect string, offset: 0xd4eec): defaultTaskHandle
    <cf6>   DW_AT_decl_file   : 1
    <cf7>   DW_AT_decl_line   : 50
    <cf8>   DW_AT_decl_column : 12
    <cf9>   DW_AT_type        : <0xc46>
    <cfd>   DW_AT_external    : 1
    <cfd>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><d03>: Abbrev Number: 13 (DW_TAG_variable)
    <d04>   DW_AT_name        : (indirect string, offset: 0xd5a9e): xIdleTaskTCBBuffer
    <d08>   DW_AT_decl_file   : 1
    <d08>   DW_AT_decl_line   : 65
    <d09>   DW_AT_decl_column : 21
    <d0a>   DW_AT_type        : <0xb36>
    <d0e>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><d14>: Abbrev Number: 6 (DW_TAG_array_type)
    <d15>   DW_AT_type        : <0xa0d>
    <d19>   DW_AT_sibling     : <0xd24>
 <2><d1d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <d1e>   DW_AT_type        : <0x97d>
    <d22>   DW_AT_upper_bound : 127
 <2><d23>: Abbrev Number: 0
 <1><d24>: Abbrev Number: 13 (DW_TAG_variable)
    <d25>   DW_AT_name        : (indirect string, offset: 0xd43ef): xIdleStack
    <d29>   DW_AT_decl_file   : 1
    <d29>   DW_AT_decl_line   : 66
    <d2a>   DW_AT_decl_column : 20
    <d2b>   DW_AT_type        : <0xd14>
    <d2f>   DW_AT_location    : 5 byte block: 3 e8 0 0 20 	(DW_OP_addr: 200000e8)
 <1><d35>: Abbrev Number: 15 (DW_TAG_subprogram)
    <d36>   DW_AT_external    : 1
    <d36>   DW_AT_name        : (indirect string, offset: 0xd804b): osDelay
    <d3a>   DW_AT_decl_file   : 7
    <d3a>   DW_AT_decl_line   : 478
    <d3c>   DW_AT_decl_column : 10
    <d3d>   DW_AT_prototyped  : 1
    <d3d>   DW_AT_type        : <0xc18>
    <d41>   DW_AT_declaration : 1
    <d41>   DW_AT_sibling     : <0xd4b>
 <2><d45>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d46>   DW_AT_type        : <0x9ff>
 <2><d4a>: Abbrev Number: 0
 <1><d4b>: Abbrev Number: 15 (DW_TAG_subprogram)
    <d4c>   DW_AT_external    : 1
    <d4c>   DW_AT_name        : (indirect string, offset: 0xd4d1d): osThreadCreate
    <d50>   DW_AT_decl_file   : 7
    <d50>   DW_AT_decl_line   : 441
    <d52>   DW_AT_decl_column : 12
    <d53>   DW_AT_prototyped  : 1
    <d53>   DW_AT_type        : <0xc46>
    <d57>   DW_AT_declaration : 1
    <d57>   DW_AT_sibling     : <0xd66>
 <2><d5b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d5c>   DW_AT_type        : <0xd66>
 <2><d60>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d61>   DW_AT_type        : <0xa0b>
 <2><d65>: Abbrev Number: 0
 <1><d66>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d67>   DW_AT_byte_size   : 4
    <d67>   DW_AT_type        : <0xcec>
 <1><d6b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <d6c>   DW_AT_external    : 1
    <d6c>   DW_AT_name        : (indirect string, offset: 0xd3d94): StartDefaultTask
    <d70>   DW_AT_decl_file   : 1
    <d70>   DW_AT_decl_line   : 121
    <d71>   DW_AT_decl_column : 6
    <d71>   DW_AT_prototyped  : 1
    <d71>   DW_AT_low_pc      : 0x80006e8
    <d75>   DW_AT_high_pc     : 0x10
    <d79>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d7b>   DW_AT_call_all_tail_calls: 1
    <d7b>   DW_AT_sibling     : <0xd8e>
 <2><d7f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <d80>   DW_AT_name        : (indirect string, offset: 0xd3cf7): argument
    <d84>   DW_AT_decl_file   : 1
    <d84>   DW_AT_decl_line   : 121
    <d85>   DW_AT_decl_column : 36
    <d86>   DW_AT_type        : <0xc40>
    <d8a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d8d>: Abbrev Number: 0
 <1><d8e>: Abbrev Number: 16 (DW_TAG_subprogram)
    <d8f>   DW_AT_external    : 1
    <d8f>   DW_AT_name        : (indirect string, offset: 0xd7611): MX_FREERTOS_Init
    <d93>   DW_AT_decl_file   : 1
    <d93>   DW_AT_decl_line   : 82
    <d94>   DW_AT_decl_column : 6
    <d94>   DW_AT_prototyped  : 1
    <d94>   DW_AT_low_pc      : 0x80006b0
    <d98>   DW_AT_high_pc     : 0x38
    <d9c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d9e>   DW_AT_call_all_tail_calls: 1
    <d9e>   DW_AT_sibling     : <0xdb1>
 <2><da2>: Abbrev Number: 13 (DW_TAG_variable)
    <da3>   DW_AT_name        : (indirect string, offset: 0xd70d5): os_thread_def_defaultTask
    <da7>   DW_AT_decl_file   : 1
    <da7>   DW_AT_decl_line   : 105
    <da8>   DW_AT_decl_column : 3
    <da9>   DW_AT_type        : <0xcec>
    <dad>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><db0>: Abbrev Number: 0
 <1><db1>: Abbrev Number: 26 (DW_TAG_subprogram)
    <db2>   DW_AT_external    : 1
    <db2>   DW_AT_name        : (indirect string, offset: 0xd6e08): vApplicationGetIdleTaskMemory
    <db6>   DW_AT_decl_file   : 1
    <db7>   DW_AT_decl_line   : 68
    <db8>   DW_AT_decl_column : 6
    <db9>   DW_AT_prototyped  : 1
    <db9>   DW_AT_low_pc      : 0x800067c
    <dbd>   DW_AT_high_pc     : 0x34
    <dc1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc3>   DW_AT_call_all_calls: 1
    <dc3>   DW_AT_sibling     : <0xdf2>
 <2><dc7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dc8>   DW_AT_name        : (indirect string, offset: 0xd5a9c): ppxIdleTaskTCBBuffer
    <dcc>   DW_AT_decl_file   : 1
    <dcc>   DW_AT_decl_line   : 68
    <dcd>   DW_AT_decl_column : 52
    <dce>   DW_AT_type        : <0xdf2>
    <dd2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><dd5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <dd6>   DW_AT_name        : (indirect string, offset: 0xd60a4): ppxIdleTaskStackBuffer
    <dda>   DW_AT_decl_file   : 1
    <dda>   DW_AT_decl_line   : 68
    <ddb>   DW_AT_decl_column : 88
    <ddc>   DW_AT_type        : <0xdfc>
    <de0>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><de3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <de4>   DW_AT_name        : (indirect string, offset: 0xd5d1e): pulIdleTaskStackSize
    <de8>   DW_AT_decl_file   : 1
    <de8>   DW_AT_decl_line   : 68
    <de9>   DW_AT_decl_column : 122
    <dea>   DW_AT_type        : <0xcd5>
    <dee>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><df1>: Abbrev Number: 0
 <1><df2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <df3>   DW_AT_byte_size   : 4
    <df3>   DW_AT_type        : <0xdf7>
 <1><df7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <df8>   DW_AT_byte_size   : 4
    <df8>   DW_AT_type        : <0xb36>
 <1><dfc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <dfd>   DW_AT_byte_size   : 4
    <dfd>   DW_AT_type        : <0xb60>
 <1><e01>: Abbrev Number: 0
  Compilation Unit @ offset 0xe02:
   Length:        0x2b3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3f4
   Pointer Size:  4
 <0><e0e>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <e0f>   DW_AT_producer    : (indirect string, offset: 0xcdcad): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e13>   DW_AT_language    : 29	(C11)
    <e14>   DW_AT_name        : (indirect string, offset: 0xd894d): ../Core/Src/gpio.c
    <e18>   DW_AT_comp_dir    : (indirect string, offset: 0xfe60): C:/Users/nikit/STM32CubeIDE/workspace_1.19.0/EmbLab2/Debug
    <e1c>   DW_AT_ranges      : 0x51
    <e20>   DW_AT_low_pc      : 0
    <e24>   DW_AT_stmt_list   : 0x189a
    <e28>   DW_AT_macros      : 0x22201
 <1><e2c>: Abbrev Number: 2 (DW_TAG_base_type)
    <e2d>   DW_AT_byte_size   : 1
    <e2e>   DW_AT_encoding    : 6	(signed char)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x687b8): signed char
 <1><e33>: Abbrev Number: 2 (DW_TAG_base_type)
    <e34>   DW_AT_byte_size   : 1
    <e35>   DW_AT_encoding    : 8	(unsigned char)
    <e36>   DW_AT_name        : (indirect string, offset: 0xc9e7f): unsigned char
 <1><e3a>: Abbrev Number: 2 (DW_TAG_base_type)
    <e3b>   DW_AT_byte_size   : 2
    <e3c>   DW_AT_encoding    : 5	(signed)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x9bd12): short int
 <1><e41>: Abbrev Number: 2 (DW_TAG_base_type)
    <e42>   DW_AT_byte_size   : 2
    <e43>   DW_AT_encoding    : 7	(unsigned)
    <e44>   DW_AT_name        : (indirect string, offset: 0xc875a): short unsigned int
 <1><e48>: Abbrev Number: 2 (DW_TAG_base_type)
    <e49>   DW_AT_byte_size   : 4
    <e4a>   DW_AT_encoding    : 5	(signed)
    <e4b>   DW_AT_name        : (indirect string, offset: 0x115e7): long int
 <1><e4f>: Abbrev Number: 6 (DW_TAG_typedef)
    <e50>   DW_AT_name        : (indirect string, offset: 0x854dd): __uint32_t
    <e54>   DW_AT_decl_file   : 2
    <e55>   DW_AT_decl_line   : 79
    <e56>   DW_AT_decl_column : 25
    <e57>   DW_AT_type        : <0xe5b>
 <1><e5b>: Abbrev Number: 2 (DW_TAG_base_type)
    <e5c>   DW_AT_byte_size   : 4
    <e5d>   DW_AT_encoding    : 7	(unsigned)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x4f87b): long unsigned int
 <1><e62>: Abbrev Number: 2 (DW_TAG_base_type)
    <e63>   DW_AT_byte_size   : 8
    <e64>   DW_AT_encoding    : 5	(signed)
    <e65>   DW_AT_name        : (indirect string, offset: 0x5f061): long long int
 <1><e69>: Abbrev Number: 2 (DW_TAG_base_type)
    <e6a>   DW_AT_byte_size   : 8
    <e6b>   DW_AT_encoding    : 7	(unsigned)
    <e6c>   DW_AT_name        : (indirect string, offset: 0x2b4f1): long long unsigned int
 <1><e70>: Abbrev Number: 8 (DW_TAG_base_type)
    <e71>   DW_AT_byte_size   : 4
    <e72>   DW_AT_encoding    : 5	(signed)
    <e73>   DW_AT_name        : int
 <1><e77>: Abbrev Number: 2 (DW_TAG_base_type)
    <e78>   DW_AT_byte_size   : 4
    <e79>   DW_AT_encoding    : 7	(unsigned)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x10bb4): unsigned int
 <1><e7e>: Abbrev Number: 6 (DW_TAG_typedef)
    <e7f>   DW_AT_name        : (indirect string, offset: 0xd6e82): uint32_t
    <e83>   DW_AT_decl_file   : 3
    <e84>   DW_AT_decl_line   : 48
    <e85>   DW_AT_decl_column : 20
    <e86>   DW_AT_type        : <0xe4f>
 <1><e8a>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e8b>   DW_AT_type        : <0xe7e>
 <1><e8f>: Abbrev Number: 10 (DW_TAG_array_type)
    <e90>   DW_AT_type        : <0xe7e>
    <e94>   DW_AT_sibling     : <0xe9f>
 <2><e98>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e99>   DW_AT_type        : <0xe77>
    <e9d>   DW_AT_upper_bound : 1
 <2><e9e>: Abbrev Number: 0
 <1><e9f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ea0>   DW_AT_byte_size   : 144
    <ea1>   DW_AT_decl_file   : 4
    <ea2>   DW_AT_decl_line   : 643
    <ea4>   DW_AT_decl_column : 9
    <ea5>   DW_AT_sibling     : <0x1029>
 <2><ea9>: Abbrev Number: 4 (DW_TAG_member)
    <eaa>   DW_AT_name        : CR
    <ead>   DW_AT_decl_file   : 4
    <ead>   DW_AT_decl_line   : 645
    <eaf>   DW_AT_decl_column : 17
    <eaf>   DW_AT_type        : <0xe8a>
    <eb3>   DW_AT_data_member_location: 0
 <2><eb4>: Abbrev Number: 1 (DW_TAG_member)
    <eb5>   DW_AT_name        : (indirect string, offset: 0xd89e4): PLLCFGR
    <eb9>   DW_AT_decl_file   : 4
    <eb9>   DW_AT_decl_line   : 646
    <ebb>   DW_AT_decl_column : 17
    <ebb>   DW_AT_type        : <0xe8a>
    <ebf>   DW_AT_data_member_location: 4
 <2><ec0>: Abbrev Number: 1 (DW_TAG_member)
    <ec1>   DW_AT_name        : (indirect string, offset: 0xd8a0f): CFGR
    <ec5>   DW_AT_decl_file   : 4
    <ec5>   DW_AT_decl_line   : 647
    <ec7>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0xe8a>
    <ecb>   DW_AT_data_member_location: 8
 <2><ecc>: Abbrev Number: 4 (DW_TAG_member)
    <ecd>   DW_AT_name        : CIR
    <ed1>   DW_AT_decl_file   : 4
    <ed1>   DW_AT_decl_line   : 648
    <ed3>   DW_AT_decl_column : 17
    <ed3>   DW_AT_type        : <0xe8a>
    <ed7>   DW_AT_data_member_location: 12
 <2><ed8>: Abbrev Number: 1 (DW_TAG_member)
    <ed9>   DW_AT_name        : (indirect string, offset: 0xd89ec): AHB1RSTR
    <edd>   DW_AT_decl_file   : 4
    <edd>   DW_AT_decl_line   : 649
    <edf>   DW_AT_decl_column : 17
    <edf>   DW_AT_type        : <0xe8a>
    <ee3>   DW_AT_data_member_location: 16
 <2><ee4>: Abbrev Number: 1 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0xd8937): AHB2RSTR
    <ee9>   DW_AT_decl_file   : 4
    <ee9>   DW_AT_decl_line   : 650
    <eeb>   DW_AT_decl_column : 17
    <eeb>   DW_AT_type        : <0xe8a>
    <eef>   DW_AT_data_member_location: 20
 <2><ef0>: Abbrev Number: 1 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xd899d): AHB3RSTR
    <ef5>   DW_AT_decl_file   : 4
    <ef5>   DW_AT_decl_line   : 651
    <ef7>   DW_AT_decl_column : 17
    <ef7>   DW_AT_type        : <0xe8a>
    <efb>   DW_AT_data_member_location: 24
 <2><efc>: Abbrev Number: 1 (DW_TAG_member)
    <efd>   DW_AT_name        : (indirect string, offset: 0xd8a20): RESERVED0
    <f01>   DW_AT_decl_file   : 4
    <f01>   DW_AT_decl_line   : 652
    <f03>   DW_AT_decl_column : 17
    <f03>   DW_AT_type        : <0xe7e>
    <f07>   DW_AT_data_member_location: 28
 <2><f08>: Abbrev Number: 1 (DW_TAG_member)
    <f09>   DW_AT_name        : (indirect string, offset: 0xd892e): APB1RSTR
    <f0d>   DW_AT_decl_file   : 4
    <f0d>   DW_AT_decl_line   : 653
    <f0f>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0xe8a>
    <f13>   DW_AT_data_member_location: 32
 <2><f14>: Abbrev Number: 1 (DW_TAG_member)
    <f15>   DW_AT_name        : (indirect string, offset: 0xd8994): APB2RSTR
    <f19>   DW_AT_decl_file   : 4
    <f19>   DW_AT_decl_line   : 654
    <f1b>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0xe8a>
    <f1f>   DW_AT_data_member_location: 36
 <2><f20>: Abbrev Number: 1 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0xd8a2a): RESERVED1
    <f25>   DW_AT_decl_file   : 4
    <f25>   DW_AT_decl_line   : 655
    <f27>   DW_AT_decl_column : 17
    <f27>   DW_AT_type        : <0xe8f>
    <f2b>   DW_AT_data_member_location: 40
 <2><f2c>: Abbrev Number: 1 (DW_TAG_member)
    <f2d>   DW_AT_name        : (indirect string, offset: 0xd8926): AHB1ENR
    <f31>   DW_AT_decl_file   : 4
    <f31>   DW_AT_decl_line   : 656
    <f33>   DW_AT_decl_column : 17
    <f33>   DW_AT_type        : <0xe8a>
    <f37>   DW_AT_data_member_location: 48
 <2><f38>: Abbrev Number: 1 (DW_TAG_member)
    <f39>   DW_AT_name        : (indirect string, offset: 0xd8974): AHB2ENR
    <f3d>   DW_AT_decl_file   : 4
    <f3d>   DW_AT_decl_line   : 657
    <f3f>   DW_AT_decl_column : 17
    <f3f>   DW_AT_type        : <0xe8a>
    <f43>   DW_AT_data_member_location: 52
 <2><f44>: Abbrev Number: 1 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0xd89ae): AHB3ENR
    <f49>   DW_AT_decl_file   : 4
    <f49>   DW_AT_decl_line   : 658
    <f4b>   DW_AT_decl_column : 17
    <f4b>   DW_AT_type        : <0xe8a>
    <f4f>   DW_AT_data_member_location: 56
 <2><f50>: Abbrev Number: 1 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0xd8a34): RESERVED2
    <f55>   DW_AT_decl_file   : 4
    <f55>   DW_AT_decl_line   : 659
    <f57>   DW_AT_decl_column : 17
    <f57>   DW_AT_type        : <0xe7e>
    <f5b>   DW_AT_data_member_location: 60
 <2><f5c>: Abbrev Number: 1 (DW_TAG_member)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xd89c8): APB1ENR
    <f61>   DW_AT_decl_file   : 4
    <f61>   DW_AT_decl_line   : 660
    <f63>   DW_AT_decl_column : 17
    <f63>   DW_AT_type        : <0xe8a>
    <f67>   DW_AT_data_member_location: 64
 <2><f68>: Abbrev Number: 1 (DW_TAG_member)
    <f69>   DW_AT_name        : (indirect string, offset: 0xd8940): APB2ENR
    <f6d>   DW_AT_decl_file   : 4
    <f6d>   DW_AT_decl_line   : 661
    <f6f>   DW_AT_decl_column : 17
    <f6f>   DW_AT_type        : <0xe8a>
    <f73>   DW_AT_data_member_location: 68
 <2><f74>: Abbrev Number: 1 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0xd8a3e): RESERVED3
    <f79>   DW_AT_decl_file   : 4
    <f79>   DW_AT_decl_line   : 662
    <f7b>   DW_AT_decl_column : 17
    <f7b>   DW_AT_type        : <0xe8f>
    <f7f>   DW_AT_data_member_location: 72
 <2><f80>: Abbrev Number: 1 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0xd89f5): AHB1LPENR
    <f85>   DW_AT_decl_file   : 4
    <f85>   DW_AT_decl_line   : 663
    <f87>   DW_AT_decl_column : 17
    <f87>   DW_AT_type        : <0xe8a>
    <f8b>   DW_AT_data_member_location: 80
 <2><f8c>: Abbrev Number: 1 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0xd8960): AHB2LPENR
    <f91>   DW_AT_decl_file   : 4
    <f91>   DW_AT_decl_line   : 664
    <f93>   DW_AT_decl_column : 17
    <f93>   DW_AT_type        : <0xe8a>
    <f97>   DW_AT_data_member_location: 84
 <2><f98>: Abbrev Number: 1 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0xd89da): AHB3LPENR
    <f9d>   DW_AT_decl_file   : 4
    <f9d>   DW_AT_decl_line   : 665
    <f9f>   DW_AT_decl_column : 17
    <f9f>   DW_AT_type        : <0xe8a>
    <fa3>   DW_AT_data_member_location: 88
 <2><fa4>: Abbrev Number: 1 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0xd8a48): RESERVED4
    <fa9>   DW_AT_decl_file   : 4
    <fa9>   DW_AT_decl_line   : 666
    <fab>   DW_AT_decl_column : 17
    <fab>   DW_AT_type        : <0xe7e>
    <faf>   DW_AT_data_member_location: 92
 <2><fb0>: Abbrev Number: 1 (DW_TAG_member)
    <fb1>   DW_AT_name        : (indirect string, offset: 0xd89ff): APB1LPENR
    <fb5>   DW_AT_decl_file   : 4
    <fb5>   DW_AT_decl_line   : 667
    <fb7>   DW_AT_decl_column : 17
    <fb7>   DW_AT_type        : <0xe8a>
    <fbb>   DW_AT_data_member_location: 96
 <2><fbc>: Abbrev Number: 1 (DW_TAG_member)
    <fbd>   DW_AT_name        : (indirect string, offset: 0xd896a): APB2LPENR
    <fc1>   DW_AT_decl_file   : 4
    <fc1>   DW_AT_decl_line   : 668
    <fc3>   DW_AT_decl_column : 17
    <fc3>   DW_AT_type        : <0xe8a>
    <fc7>   DW_AT_data_member_location: 100
 <2><fc8>: Abbrev Number: 1 (DW_TAG_member)
    <fc9>   DW_AT_name        : (indirect string, offset: 0xd8a52): RESERVED5
    <fcd>   DW_AT_decl_file   : 4
    <fcd>   DW_AT_decl_line   : 669
    <fcf>   DW_AT_decl_column : 17
    <fcf>   DW_AT_type        : <0xe8f>
    <fd3>   DW_AT_data_member_location: 104
 <2><fd4>: Abbrev Number: 1 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0xd8948): BDCR
    <fd9>   DW_AT_decl_file   : 4
    <fd9>   DW_AT_decl_line   : 670
    <fdb>   DW_AT_decl_column : 17
    <fdb>   DW_AT_type        : <0xe8a>
    <fdf>   DW_AT_data_member_location: 112
 <2><fe0>: Abbrev Number: 4 (DW_TAG_member)
    <fe1>   DW_AT_name        : CSR
    <fe5>   DW_AT_decl_file   : 4
    <fe5>   DW_AT_decl_line   : 671
    <fe7>   DW_AT_decl_column : 17
